[{"pk": 1, "model": "philly.school", "fields": {"essay": false, "pssa_math": 2, "essay_topic": "", "mission": "As an academic liberal arts magnet school, the clear mission of The Academy is to provide our students \r\nwith the most comprehensive and intense preparation available in the public sector for the rigors of higher \r\nlearning. As an integral part of this preparation The Academy’s mission must include raising the aspirations \r\nof each student, developing universally applicable problem solving techniques, technological skills, and \r\ninstilling a life-long passion for learning including a rich cultural arts experience.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Art Studio; Biology; Calculus AB; Chemistry; Chinese; English Literature and \r\nComposition; European History; Government and Politics; Physics B; Psychology; Spanish; Statistics; US History", "sports": "Football, Cheerleading, Girls’ and Boys’ Soccer, Girls’ and Boys’ Volleyball, Girls’ and Boys’ Basketball, \r\nBadminton, Girls’ and Boys’ Track, Baseball, Softball, Bowling, Tennis", "other": "", "grading_style_c_num": 1, "pride": "Active Home and School Association; School Advisory Council; National Honor Society; Online school \r\nnewspaper developed through the Prime Movers partnership; National Moot Court Finalists; Project Pride Peer \r\nMediators; Peer Mentors; All-City Choir and Orchestra Members; Youth Women’s Symposium; Walking in \r\nHonor Male Mentoring; VIEW with Villanova Female Mentoring, Career, Multicultural and College Fair Day", "attendance_time": 1, "locationnumber": "2620", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 93, "name": "Academy at Palumbo", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Anime Club, Chess Club, Community Service Club, Debate Club Team, GSA Club, Inkblot Literary Magazine, \r\nJazz Band, Rock Band, Multicultural Club, National Academic League, Pep Squad, Poetry, Rock Band, Science \r\nCarver Fair, Garden Club", "school_type": 2, "national_norm": 88, "invite_only": false, "partnerships": "As a former Weighted Student Funding School our Community Partners are SEAMAAC, Moonstone Daycare, \r\nUniversity of Pennsylvania School of Law, National Liberty Museum, Museum of Jewish History, and the \r\nAfrican American Museum."}}, {"pk": 2, "model": "philly.school", "fields": {"essay": false, "pssa_math": 1, "essay_topic": "", "mission": "Our special admissions school is based on the belief that the arts provide an unequaled opportunity to foster \r\nintellectual growth by connecting arts and literacy. Visual and media literacy skills permeate all subjects at the \r\nhigh school. Reflective teaching and learning are expected in every classroom with an emphasis on building a \r\ncommunity of learners to be thinkers and creators, and who are preparing for college or professional careers.", "grading_style_c_time": 0, "highlights": "Advanced Placement Course:  Chemistry, English, Spanish, Art and Calculus.\r\nHonors courses offered: Physics, English \r\nDual Enrollment Programs: Holy Family University, Community College of Philadelphia. Electives offered \r\nin story casting (digital film making), creating theatre, graphic arts, media arts, dance appreciation, chamber \r\nsinging, debate, journalism and much more.", "sports": "Girls’ Soccer, Track and Field, Girls’ and Boys’ Basketball, Girls’ Volleyball, Baseball, Softball, various \r\nintramural activities", "other": "Successful audition in chosen major (art, dance, music, or theatre) required", "grading_style_c_num": 1, "pride": "Profiled in the Philadelphia Inquirer and gained national recognition in sites such as ASCD’s SmartBriefs and \r\nNCTE’s Inbox; First place award winner in the One Book, One Philadelphia Graphic Arts Contest; Accolades \r\nin the Philadelphia Sketch Club; First place winner in the Philadelphia Young Playwriting monologue contest; \r\nmany students participate in all-city orchestra and choir; Web 2.0 tools are used in curriculum and instruction \r\nat the school; Classrooms are equipped with Promethean boards to support learning", "attendance_time": 1, "locationnumber": "8050", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 0, "name": "Arts Academy at Benjamin Rush", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Girls for Change Club, Environmental Awareness Club, Jazz Ensemble, Math Club, Media Arts Club, Model \r\nUN, Student Government, Literary Journal, Yearbook, Build On Service Learning", "school_type": 2, "national_norm": 75, "invite_only": false, "partnerships": "Arden Theatre Company, Astral Artists, Drexel University, Department of Creative Arts Therapies, National \r\nDance Education Organization, Opera Company of Philadelphia, PBS News Hour, Senior Adults for Greater \r\nEducation (SAGE), Temple Media Education Lab, Tyler School of Art, University of Pennsylvania, WHYY, \r\nWorld Affairs Council, Woodmere Art Museum. "}}, {"pk": 3, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "John Bartram High School is a neighborhood school located in Southwest Philadelphia, with approximately \r\n1300 students in attendance. In 2009-2010 school year, we were removed from the state list of persistently \r\ndangerous schools, a testament to the hard work of staff, parents, and students towards building a positive \r\nlearning environment. While we are located in a low SES environment, we take pride in the achievements of \r\nour students and the opportunities available to them.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: English Language and Composition; English Literature and Composition \r\nSmall Learning Communities: Ninth Grade Academy; Crossroads/JROTC Academy; Health Academy; Creative \r\nand Performing Arts Academy; Senior Academy; Mentally Gifted Enrichment Program", "sports": "Football, Cheerleading, Co-ed Cross Country, Boys’ Tennis, Boys’ and Girls’ Basketball, Bowling, Baseball, \r\nBadminton, Softball", "other": "", "grading_style_c_num": 0, "pride": "Student Government Association, which allows for the expression and exploration of self-empowerment. \r\nPeace Circle, which allows students to assume responsibility for the creation and sustenance of a tolerant \r\ncommunity \r\nYouth Court, which, in conjunction with University of Penn, allows students to practice trial advocacy teaching \r\nthem to navigate law and it’s practices by working with real lawyers and fictitious law cases \r\nPeer Mentoring and Conflict Resolution, which provide students with opportunities to practice empathy, active \r\nlistening, and a decision making process", "attendance_time": 0, "locationnumber": "1010", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 46, "name": "John Bartram High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "National Honor Society, Peer Mentoring Program", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Southwest Epic Stakeholders, Greater Philadelphia Urban Affairs, Elect & MARS, Ed. Works"}}, {"pk": 4, "model": "philly.school", "fields": {"essay": true, "pssa_math": 1, "essay_topic": "Writing Sample", "mission": "The mission of Bodine High School is to provide urban students with a comprehensive college preparatory \r\neducation that enables young people to envision themselves as informed citizens and caring leaders for our \r\nnation and the world. In partnership with the World Affairs Council, Bodine promotes participation in \r\nstudent seminars, diplomatic and governmental simulations, student exchanges, travel abroad and WAC \r\nspeakers’ events. The rigorous curriculum is delivered by a faculty dedicated to the cultivation of the potential \r\nof each student, and the student body practices the motto, “harmony in diversity.” Bodine fosters disciplined, \r\nethical thinking, and the capacity to entertain multiple world views.", "grading_style_c_time": 0, "highlights": "Spring Honors Seminar\r\nAdvanced Placement Courses: Calculus A-B; English Literature and Composition; English Language and \r\nComposition; Physics; Spanish Language; United States History\r\nDual Enrollment/College Excel  (if funded for SY 2011-12)\r\nInternational Baccalaureate Diploma Program\r\nElectives: World Literature; Ceramics; Computer Science 1, 2, and 3; Crafts; International Economics; \r\nInternational Law; Introduction to Business; Japanese Studies; SAT Prep; Statistics; World Geography, \r\nConceptual Physics, Anatomy & Physiology.", "sports": "Football (Mastbaum High School), Cheerleading, Boys’ and Girls’ Soccer, Boys’ and Girls’ Tennis, Boys’ and \r\nGirls’ Basketball, Co-ed Swimming & Gymnastics (regional), Girls’ Badminton, Baseball, Softball", "other": "", "grading_style_c_num": 1, "pride": "Spring Trip Abroad (2011-Paris & the Loire Valley), Legislative, Executive and Diplomatic tour of Washington, \r\nD. C., PTC Colombian Student Exchange, Beijing Sisters Student Exchange, 2009 National Blue Ribbon School; \r\n2010 School District Vanguard School, Rated 1.1; Three Dr. Ruth Wright Hayre Teachers of the Year in three \r\nconsecutive years, Ms. Gina Hart (2008), Mr. Brian Malloy (2009), and Mr. Aaron Greberman (2010); 2010- \r\n100% Graduation Rate and 99% college acceptance rate; 2009 Host to former Secretary of State, Dr. Condoleeza \r\nRice; 2010 Host to Deputy Secretary of Education, Tony Miller; International Baccalaureate School since \r\n2005; 14 PIAA Interscholastic sports teams, 22 Extra-curricular academic teams and cultural clubs; 100-hour \r\nminimum service requirement for all students.", "attendance_time": 1, "locationnumber": "5150", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 90, "name": "William W. Bodine High School for International Affairs", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Academic World Quest, Ambassador (yearbook), Asian Club, Blueprint (literary magazine), Build-on, \r\nComputer Builders Club, Debate, Envirothon, Half-the-Sky Club, International Day Committee, Latino Culture \r\nClub, Mock Trial, National Academic League, National Honor Society, Philadelphia Student Union, Puerto \r\nRican Day Dancers, Red Cross Club, Safe Space, Science Fair Club, Student Government Association, World \r\nAffairs Club ", "school_type": 2, "national_norm": 80, "invite_only": false, "partnerships": "World Affairs Council of Philadelphia, Philadelphia Mural Arts/Restored Spaces Project 2010-2012, \r\nPerspectives Debate, Girls, Inc., Pricewaterhouse Coopers IMPACT, Villanova VIEW, Build-on, American Red \r\nCross, Philadelphia Student Union, Summer Search Philadelphia, Temple LEAP, Temple University Scientists as \r\nTeachers/Teachers as Scientists "}}, {"pk": 5, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Bok has an energetic, safe climate where teachers can effectively teach and students can attain academic \r\nskills, as well as marketable vocational skills.  Our mission is to prepare students to be successful as they \r\nencounter challenges in school, life, post-secondary education and employment.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs of Study:  A+ Networking; Accounting; Business Information Technology; Carpentry; \r\nCriminal Justice; Culinary; Health Related Technologies,; Mechatronics (Process Technology and Applied \r\nEngineering); Sports Marketing\r\nAdvanced Placement Courses: English Literature and Composition; Environmental Science; United States \r\nHistory", "sports": "Varsity and JV Football, Cheerleading, Co-ed Cross Country and Track and Field, Boys’ and Girls’ Bowling \r\n(citywide), Girls’ Volleyball (citywide), Boys’ and Girls’ Varsity and JV Basketball, Girls’ Badminton (citywide), \r\nVarsity and JV Baseball, Varsity and JV Softball, Co-ed Weight-lifting (intramural)", "other": "Interview by invitation only.", "grading_style_c_num": 0, "pride": "Edward W. Bok Technical High School has made AYP for the past three consecutive years; High Average \r\nStudent Daily Attendance – 88%; Low Teacher Turnover –High Teacher Attendance – 97%; Music and Art \r\nPrograms offered; Training offered in PA State identified High-Priority Occupations; High Graduation Rate; \r\n65% of Graduates continue to Post-Secondary Education; Extensive Sports Programs Available; Bok was \r\nawarded ‘Top Ten’ Best Performing Career and Technical Schools in PA -2009 & 2010; US News and World \r\nReports listed Bok in top 9 schools of Philadelphia School District", "attendance_time": 0, "locationnumber": "2090", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 62, "name": "Edward Bok", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Chess, Choir, Computer Repair Club, FBLA – Future Business Leaders of America, Going to College Club, \r\nHOSA – Health Occupation Students of America, Red Cross, Robotics Club, Skills USA competitions, Student \r\nGovernment", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Sunoco, Philadelphia Gas Works, Philadelphia Water Department, CHOP (Children’s Hospital of Philadelphia), \r\nAfter-School Variety Club, Sunrise Inc. of Philadelphia, Philadelphia Academies"}}, {"pk": 6, "model": "philly.school", "fields": {"essay": false, "pssa_math": 1, "essay_topic": "", "mission": "The mission of the High School for Creative and Performing Arts is to nurture the creative talents and \r\naspirations of its students within an academic/arts college preparatory program. In a multicultural \r\nenvironment, we provide a comprehensive and sequenced program of study in six arts disciplines, as well as \r\nrigorous pre-college academic instruction across the curriculum. Our graduates will demonstrate a mastery \r\nof defined skills that enable them to be productive, self-directed, lifelong learners, who appreciate and   \r\nrespect diversity.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Cinematography & Film/Video Production; Commercial and Advertising Art\r\nAdvanced Placement Courses: Biology; English Language and Composition; English Literature and \r\nComposition; Music Theory; World History                                                                                                                        \r\nArt Majors: Theater; Dance; Instrumental Music; Vocal Music; Visual Arts; Creative Writing                        \r\nHonors Courses offered in all core subjects.", "sports": "Co-ed Cross Country, Girls’ Volleyball, Boys’ Basketball, Boys’ Volleyball, Girls’ Softball", "other": "Successful audition in the chosen art field.", "grading_style_c_num": 1, "pride": "Annual participation in the Channel 6 Thanksgiving Day Parade; Instrumental students participate in district, \r\nstate and regional orchestras and bands; Award-winning United Writers and Artists literary magazine; 99% \r\ngraduation rate; 97% percent college acceptance rate; Vocal music students perform during annual holiday \r\nevents and special celebrations throughout the city and region; Theater students provide interactive, literacyfocused theater activities for elementary students; Award-winning visual art work produced for School District \r\nannual art displays and at various prominent venues around the city; Dance students win annual scholarships \r\nat national/international dance competition; Annual spring musical.", "attendance_time": 1, "locationnumber": "2020", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 92, "name": "CAPA - The Philadelphia High School for the Creative and Performing Arts", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Bible Study, Book Club, Down to Earth Environmental Club, Film Club, Gas-Straight Alliance, Intramural \r\nSports, Mock Trial, My Vision Theater Club, National Honor Society, Student Council, Tech Crew, United \r\nWriters and Artists Club", "school_type": 2, "national_norm": 80, "invite_only": false, "partnerships": "Young Playwrights, Philadelphia Theater Company, Pennsylvania Music Educators Association,                       \r\nRed Tettemer, Inc."}}, {"pk": 7, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Charles Carroll High School is to provide students with a quality education that follows the \r\nCore Curriculum of the School District of Philadelphia and allows students to complete the graduation \r\nrequirements as set forth by the PA Department of Education.  We strive to graduate students who will be \r\nresponsible, productive, active members of society.  Our academic focus is on Administrative Assistants and \r\nSports Marketing", "grading_style_c_time": 0, "highlights": "Accounting and Sports Marketing\r\nAdvanced Placement Courses: American History; Chemistry;  Honors English I, II, III and IV.", "sports": "Co-ed Soccer, Co-ed Bowling, Boys’  and Girls’ Basketball, Co-ed Softball (intramural), and cheerleading (intramural)", "other": "", "grading_style_c_num": 0, "pride": "National Honor Society; PIAA sports teams (basketball, bowling, soccer); laptops for student use; small school \r\nwith a teacher/student ratio of 1:27.", "attendance_time": 0, "locationnumber": "5450", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 65, "name": "Charles Carroll High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Art Club, National Honor Society, ASPIRA Leadership Club, The Diverse Authority", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Aspira, Inc."}}, {"pk": 8, "model": "philly.school", "fields": {"essay": true, "pssa_math": 2, "essay_topic": "One-page essay detailing reasons for wishing to attend George  Washington Carver High  School of Engineering and Science", "mission": "George Washington Carver High School of Engineering and Science is a special admissions magnet high \r\nschool for academically talented and motivated students interested in the sciences, mathematics, engineering, \r\ntechnology, and medicine. We provide a curriculum that is enriched and advanced, with greater depth in our \r\nspecialty areas with corollary extra-curricular opportunities. Our commitment is to equip our students with \r\nthe academic tools and scholastic mindset to be successful at competitive institutions of higher education. \r\nOur students must make a commensurate commitment, taking ownership of their learning, and striving to \r\nbecome lifelong achievers.", "grading_style_c_time": 1, "highlights": "Approved CTE Program: Engineering Technology\r\nPrograms: Bio-Medical; Pre-Engineering\r\nAdvanced Placement Courses: Biology; Calculus; Chemistry; English Literature and Composition; Physics; \r\nStatistics; U.S. History\r\nDual Enrollment Programs: Temple University; Eastern University; Community College of Philadelphia.", "sports": "Football (partnered), Cross Country, Tennis, Golf, Cheerleading, Soccer, Girls’ and Boys’ Volleyball,      \r\nBowling, Girls’ and Boys’ Basketball, Swimming (regional), Gymnastics (regional), Baseball, Softball,              \r\nCo-ed Track and Field", "other": "", "grading_style_c_num": 0, "pride": "U.S. Department of Education Blue Ribbon School, 2008; Recognized by U.S. News and World Report in the \r\n“Best High Schools in the U.S.” with Bronze commendations for 2007, 2008 and 2009; College credit through \r\nAdvanced Placement and Dual Enrollment programs; Nearly 100% graduation and college acceptance rates; \r\nSAT Scores 3rd and 4th place city-wide; HSES Annual College Fair hosting 60 colleges and universities; \r\noutstanding student and staff attendance rates (95-97%); 1st Place 2010 State Chess Championship (U1300); \r\nSemi-Finalists (2) in the 2010 National Moot Court Competition; 2nd Place Public League Cheerleading \r\nCompetition, Pyramid Division; and Middle States Association of Secondary Schools and Colleges \r\naccreditation granted April 2010.", "attendance_time": 1, "locationnumber": "4030", "grading_style_c": 1, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 96, "name": "George Washington Carver High School of Engineering and Science", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Band, Chess Club, Choir, Debate Team, National Beta Society, National Honor Society, National Society \r\nof Black Engineers, Envirothon, NAVSEA Robotics Competition, Mock Trial, Ping Pong, Red Cross Club, \r\nScrabble, Student Government, Technology Student Association, Technology Team, World Affairs CouncilModel United Nations, Yearbook", "school_type": 2, "national_norm": 85, "invite_only": false, "partnerships": "PJM Interconnections, U.S. Army Corps of Engineers, Naval Sea Systems Command (NAVSEA), Turner \r\nConstruction, Pennoni Builders, ACE Mentoring, Communities in Schools/NAF/Academy of Engineering \r\n(YOP), Temple U BITS, U.S. Naval Academy at Annapolis, U.S. Army Academy at West Point, Outward Bound \r\nExperiences Program, Arts Sanctuary at Church of the Advocate "}}, {"pk": 9, "model": "philly.school", "fields": {"essay": true, "pssa_math": 2, "essay_topic": "Writing sample of no more than one page on self-selected topic required", "mission": "We believe that through the provision of a structured environment, active encouragement and support, \r\nand as a special admissions academic magnet school, the clear mission of Central High School is to prepare \r\neach student for the rigors of higher learning.  As an integral part of this preparation, Central High School’s \r\nmission must necessarily include raising the aspirations of each student, developing universally applicable \r\nproblem solving techniques, and instilling a life-long passion for learning.  Furthermore, by the very nature \r\nof Central High School’s demographics, our mission must include the development of respect for multiple \r\ncultures, religious belief systems, life paths, and learning styles. ", "grading_style_c_time": 0, "highlights": "Dual Enrollment Programs: LaSalle University and the University of Pennsylvania\r\nInternational Baccalaureate Programme\r\nExtensive Honors and Advanced Placement courses.  Comprehensive electives in every subject area.          \r\nResearch opportunities exist in Sciences, Social Studies, and other areas.", "sports": "Comprehensive PIAA and School District of Philadelphia Athletic Program both on Varsity and Junior Varsity \r\nlevels, offering all available sports teams, cheerleading, and pep squad.", "other": "", "grading_style_c_num": 1, "pride": "Named Vanguard School by The School District of Philadelphia; Invited to apply for National Blue Ribbon \r\nstatus, Academic college-bound curriculum including 26 Advanced Placement courses, International \r\nBaccalaureate Program, and dual enrollment programs; College Admissions include almost every University \r\nin the country, with graduating class 269 generating $21.7 million dollars in scholarships, awards, and prizes; \r\nSecond oldest public school in the nation; Recognized as best secondary school in Pennsylvania by Redbook \r\nMagazine, “School of Inspiration” by the College Board, named one of twenty best high schools by Philadelphia \r\nMagazine, and recipient of a U.S. Department of Education Academic Excellence Award; 99% of the faculty \r\nof 125 hold a minimum of a Masters Degree; Extensive Art and Music program including courses and extracurricular opportunities; Full athletic program including every School District sport available for both young \r\nmen and women; Middle States Association of the colleges and schools accredited", "attendance_time": 1, "locationnumber": "6010", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 92, "name": "Central High School", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Extensive club program including a minimum of 80 different interests allows students to pursue their own \r\ninterests both before and after school; extensive Music and Art Program; Multiple Creative Writing options \r\nincluding Yearbook, Newspaper, Mirror literary magazine, and several other literary options; Student run \r\nbroadcast (video) network; Drama, Debate and Mock Trial; Departmental and student supervised tutoring \r\noptions", "school_type": 2, "national_norm": 88, "invite_only": false, "partnerships": "Associated Alumni, Home and School Association, Fox Chase Cancer Center, Student Voices, Albert Einstein \r\nMedical Center, American Poetry Review"}}, {"pk": 10, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Communications Technology High School is to inspire a passion for life-long learning and \r\nto challenge all students to realize their full academic and social potential. We seek to create a meaningful \r\ncontext for students to develop and express themselves through the mediums of communication technologies. \r\nThrough our project-based learning approach, students work cooperatively to creatively problem solve and \r\ndevelop effective methods of self-expression in order to become responsible 21st century leaders.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs of Study:  Cinematography & Video Production; Commercial & Advertising Arts; \r\nCommercial Photography\r\nAdvanced Placement Courses: English Literature and Composition; US Government and Politics", "sports": "Varsity Football, Girls’ and Boys’ Cross Country, Bowling, Girls’ and Boys’ Varsity and JV Basketball, Girls’ and \r\nBoys’ Track and Field, Cheerleading  ", "other": "Interview by invitation only.  Portfolio is required during the admissions interview. Student must have a strong interest in photography, graphic arts, or cinematography. Photography students are strongly encouraged to own their own camera.", "grading_style_c_num": 0, "pride": "Made Adequate Yearly Progress for the 2009-2010 school year; Award-winning Technology Student \r\nAssociation; AP courses offered; National Honor Society; Active Occupational Advisory Committee; Small \r\npersonalized learning environment; Award-winning athletic program", "attendance_time": 0, "locationnumber": "1060", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 71, "name": "Communications Technology High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Academic Tutoring, Chess Club, Commercial Art Club, Commercial Photography Club, Culinary Arts, \r\nNational Honor Society, National Technical Honor Society, Student Government, Technical Students’ \r\nAssociation (TSA), Yearbook", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "PECO Crown Lights Project, National Association of Black Journalists (Philadelphia Chapter), Big Picture \r\nAlliance, Philadelphia Film Institute, John Heinz Environmental Center, Harcum College, Drexel University, \r\nPhiladelphia Futures, University of Pennsylvania, Thomas Jefferson University, Temple University, Channel 10-\r\nNBC, Ruddick Trust Fund"}}, {"pk": 11, "model": "philly.school", "fields": {"essay": true, "pssa_math": 0, "essay_topic": "", "mission": "Our college preparatory academic program revolves around the themes of ACTIVE CITIZENSHIP; \r\nKNOWLEDGE OF HISTORY; and DEMOCRATIC DELIBERATION.  We prepare students to become \r\nsociety’s next generation of leaders for social change and justice.", "grading_style_c_time": 0, "highlights": "College Prep Curriculum; Advanced Placement Courses: English Literature and Composition; Environmental \r\nScience; United States History; World History; US Government\r\nDual Enrollment Program: Eight courses offered during the school day at nearby Cheyney University Urban Center; \r\nvaried electives in all disciplines; walking field trips; 60 & 90 minute classes; up to date technology\r\nUnique social studies curriculum: The Constitution; Historiography; AP social studies class for all 11th graders; \r\nWorld History/Peace Studies; social studies electives ", "sports": "Football (Benjamin Franklin High School), Cheerleading, Co-ed Cross Country, Boys’ and Girls’ Soccer \r\n(Bodine High School), Girls’ Tennis (Bodine High School), Boys’ and Girls’ Basketball, Co-ed Bowling, Baseball \r\n(Bodine High School), Softball (Bodine High School), Co-ed Track and Field", "other": "", "grading_style_c_num": 0, "pride": "Only history-themed high school in Pennsylvania; Located in historical district; 1200 student applicants \r\nfor 100 openings; 100% acceptance rate to college;  Partnerships with the National Constitution Center; \r\nGilder Lehrman Institute of American History; Ballard Spahr law firm; and The History Channel; Located \r\nnearby Independence Hall; School governance modeled after United States Constitution; Service Learning \r\nrequirement; National History Day state and national finalists; City as a campus approach; Sister school \r\nrelationship with Marafet High School, Afghanistan; Pennsylvania History Teacher of the Year; Award winning \r\nMock Trial and Debate teams; Unique Dual Enrollment program; Championship Boys Basketbal", "attendance_time": 0, "locationnumber": "2670", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 88, "name": "Constitution High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Chorus, Debate, Deejay Club, Drum Club, History Club, Mock Trial, Multicultural Club, National History Day, \r\nNewspaper, School Government, Science Fair, Shakespeare Club, Yearbook", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "National Historical Archives, Independence Branch of the Philadelphia Library, Cheyney University, \r\nPhiladelphia Museum at Atwater Kent, African American Museum, National Park Service, Drexel University, \r\nUniversity of Pennsylvania, Temple University, LaSalle University, Colonial Williamsburg"}}, {"pk": 12, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Dobbins Technical High School is to: prepare our students for an evolving global marketplace \r\nthrough rigorous academic, career, and technical instruction; allow for intellectual and personal growth in \r\na diverse and challenging environment, providing a broad array of academic and career oriented programs \r\ndesigned to connect directly to the real world; and provide academic and career based skills needed to pursue \r\nhigher education or a career in a competitive global market, all with the goal of graduating productive and \r\ncontributing citizens.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Commercial & Advertising Art (Graphic Design); Baking; Barbering; Business \r\nTechnology; Cosmetology; Culinary Arts; Fashion Design; Plumbing; Web Design\r\nAdvanced Placement Courses: English Literature and Composition; US Government", "sports": "Football, Cross Country, Soccer, Girls’ and Boys’ Basketball, Bowling, Badminton, Baseball, Softball, Track and Field, Cheerleading, Tennis, Volleyball", "other": "", "grading_style_c_num": 0, "pride": "National Honor Society Inductees; Lockheed Martin Program; Xerox Internship; Robotics Championship; \r\nPinning Ceremony; Quarterly Perfect Attendance assembly; Annual Black History Month assembly; Quarterly \r\nHonor Roll assembly; Future Business Leaders of America champions.  ", "attendance_time": 0, "locationnumber": "4060", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 74, "name": "Murrell Dobbins Technical High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Big Picture Alliance, Future Business Leaders of America, Girls Rule, Legacy, National Honor Society, Poetry Club, Red Cross Club, Robotics Club, Student Government", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Allegheny West Foundation, Health Partners, Freedom Credit Union, McDonald’s, Xerox, Lockheed Martin, Senator Shirley M. Kitchen, Representative Jewell Williams"}}, {"pk": 13, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Stephen A. Douglas High School is a small comprehensive program in Academic Division I (High School) of \r\nthe School District of Philadelphia focused on providing a rigorous academic experience through experiential \r\nand hands-on learning.  Our new Career and Technology Education program is comprised of three pathways \r\nto post-secondary college and career placement:  Building Management and Managers, Engineering and \r\nTechnology/ Project Lead the Way, and Commercial Advertising and Arts. All programs are state and/\r\nor national programs focused on preparing students for college and/or the work world.  All Career and \r\nTechnical Education programs are high priority occupation programs.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Psychology, United States History, English Literature\r\nHonors Courses in the areas of Math, English, and Science\r\nApproved CTE Programs: Building Management and Maintenance; Engineering and Technology and \r\nCommercial & Advertising and Art (Graphic Design)\r\n9th Grade Academy: All 9th graders participate in a Freshman Seminar course designed to address study and \r\nsocial skills. The course will also include an introduction to Career and Technology Education (CTE) courses \r\noffered at Douglas.", "sports": "Football (Mastbaum High School) Boys’ and Girls’ Soccer, Boys’ and Girls’ Volleyball, Boys’ and Girls’ \r\nBasketball, Co-ed Bowling, Baseball (Mastbaum High School)", "other": "", "grading_style_c_num": 0, "pride": "National Academic League; PEP Grant-Comprehensive Physical Education Program; Summer Internships; \r\nAce Mentoring Program; Seven PIAA Sports Programs; 2nd place in the city-wide CPR Olympic Competition, \r\n2nd place in the city-wide video competition; Student Government, Peer Mediation; and Project Grad Grant \r\nensuring all students have access to college; the School District of Philadelphia hired students directly from our \r\nwork-based programs", "attendance_time": 0, "locationnumber": "5240", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 80, "name": "Stephen A. Douglas High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Cheerleading, ACE Mentoring Program, Math and English Enrichment, National Academic League, Robotics, \r\nStudent Government, Yearbook Club, Open Gym Days", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Mid-Atlantic Coalition of Essential Schools, The National School Reform Faculty, New Kensington Community \r\nDevelopment Corporation, Penn State University (Project Lead The Way), Project Pride, Project Grad, Outward \r\nBound, Saint Ann’s Parish, Finishing Trades Institute, Earth Force, Energy Coordinating Agency, Temple \r\nUniversity, Community College of Philadelphia and Penn State, Homer and Berry Graphics and the Union \r\nCarpenters Training Center"}}, {"pk": 14, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Composed of a Ninth Grade Success Academy, career-based academies and an Educational Options Program, \r\nEdison-Fareira’s mission is to provide students with an education that challenges them to reach their full \r\npotential through career and technical skills and academics for both higher education and entry-level \r\nemployment.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Auto Mechanics; Childcare; Cinematography and Film & Video Production; \r\nCommercial and Advertising Art; Computer Systems Technology; Cosmetology; Culinary Arts; Electrical; \r\nHealth Information Management; Health Professions (HRT); HVAC; Warehousing; Welding\r\nAdvanced Placement Courses: English Literature and Composition; Environmental Science; Spanish Language; \r\nStatistics; US History", "sports": "Football, Cheerleading, Girls’ Tennis, Soccer, Volleyball, Boys’ and Girls’ Basketball, Wrestling, Baseball,        \r\nCo-ed Track, Girls’ Badminton, Softball", "other": "", "grading_style_c_num": 0, "pride": "Athletics; Chess Club; Department of Education Approved Career and Technical Education Programs; Preschool Demonstration Classroom; Red Cross Club; Arts Major program; active Home and School Association; \r\nESOL/Bilingual Program; National Honor Society; AP Courses; Music Program", "attendance_time": 0, "locationnumber": "5020", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 40, "name": "Thomas Alva Edison High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "C-CAP, DECA, Drama Club, EARTH Squad Robotics, FBLA, InterAct/Rotary Club, Journalism Club, Chess \r\nClub, Mock Trial/Debate Team, National Honor Society, Project LOGRO, Red Cross Club, Skills USA, Student \r\nGovernment Association, Yearbook, Knitting, GSLA", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "ASPIRA, Congreso de Latinos Unidos, Community College of Philadelphia, Philadelphia Youth Network, \r\nCommunities in Schools, St. Christopher’s Hospital, Bright Futures, Pre-School, Taller Puertorriqueño, Xerox \r\nCorporation"}}, {"pk": 15, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Samuel Fels High School is to provide a high quality education that prepares, ensures, and \r\nempowers all students to achieve their full intellectual and social potential in order to become lifelong \r\nlearners and productive members of society.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Business Technology; Cinematography & Film/Video Production\r\nAdvanced Placement Courses: English Literature and Composition, Statistics\r\nDual Enrollment Program: Holy Family University", "sports": "Football, Boys’ Soccer, Bowling, Girls’ and Boys’ Basketball, Intramural Basketball, Badminton (City-wide), Baseball, Softball, Volleyball, Track", "other": "", "grading_style_c_num": 0, "pride": "Brand new $85 million facility with a beautiful campus; Olympic swimming pool; State of the art gymnasium; \r\nTelevision studio; Promethean boards in every classroom; Nine fully equipped Science labs; Interscholastic \r\nSports Programs; Honors classes in all core subjects; AP classes in English and Physics; Active Home and \r\nSchool Association", "attendance_time": 0, "locationnumber": "7120", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 53, "name": "Samuel S. Fels High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Academic Tutoring, Band, Chess, Choir, National Honor Society, Peer Mediation, Student Government", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Cambodian Society of Greater Philadelphia"}}, {"pk": 16, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Thomas Fitzsimons High School for Boys is to provide a comprehensive preparatory education \r\nthrough academically rigorous instruction and technology rich programs. Our mission also seeks to address \r\nthe academic and social/emotional needs of young men. We pride ourselves in contributing to the holistic \r\ndevelopment of our students and we seek to connect them to the highest standards of excellence through \r\nthe development of their academic, social and emotional skills. The young men at Thomas Fitzsimons High \r\nSchool for Boys will become confident learners as well as effective partners in their education and will serve \r\nthe community with class and distinction.  ", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Video Gaming Program\r\nAdvanced Placement Courses: English Literature and Composition", "sports": "Basketball, Football, Baseball, Bowling, Golf, Lacrosse, Soccer, Track & Field", "other": "", "grading_style_c_num": 0, "pride": "Jazz Band; Video Gaming Program (First in the Commonwealth of Pennsylvania), First Lacrosse Team in \r\nSchool District of Philadelphia, Nu Sigma Youth Services, Sankofa Rights Passage Mentoring Program, \r\nEducation Works etc.", "attendance_time": 0, "locationnumber": "4110", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 49, "name": "Young Men’s Leadership School at FitzSimons High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Promise Academy sponsored Social Enrichments include:  Jazz Band, Chess, Club, Lacrosse Club, Drum line, \r\nStep Team, Yearbook, Creative Writing, Student Government, Weightlifting (Partial List) ", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Community College of Philadelphia, Education Works, Nu Sigma Youth Services, Sankofa Rights of Passages \r\nMentoring Program, College Access Programs such as Upward Bound, Delaware Valley College Tour Program, \r\na Student Success Center"}}, {"pk": 17, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Frankford High School is to provide each student with the opportunity to acquire the \r\nknowledge and skills needed to become productive citizens.  The vision of Frankford High School will \r\nbe realized by offering a comprehensive curriculum in a caring and safe environment while working in \r\npartnership with families and the community.", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Building Management/Property Maintenance\r\nAdvanced Placement Courses: Calculus; English Literature and Composition; Physics; US Government;             \r\nUS History\r\nHonors courses offered in all major subjects.\r\nDual Enrollment Programs: Community College of Philadelphia; Holy Family University\r\nElectives: Accounting and Finance; Anatomy; Community Service; Criminal Law; Forensics; SAT Math and \r\nEnglish; Technology; Teen Court", "sports": "Varsity and JV Football, Field Hockey, Coed Cross Country, Girls’ and Boys’ Soccer, Wrestling, Cheerleading \r\n(citywide), Girls’ and Boys’ Tennis, Coed Bowling (citywide), Badminton (citywide), Girls’ and Boys’ Volleyball, \r\nVarsity and JV Girls’ and Boys’ Basketball, Varsity and JV Baseball, Varsity and JV Softball, Coed Track", "other": "", "grading_style_c_num": 0, "pride": "Home of championship athletic teams in football, soccer, baseball, basketball, field hockey and cheerleading; \r\nHome of many outstanding scholars; Jahri Evans of the Super Bowl Champion New Orleans Saints is a graduate \r\nof the class of 2001 and the recipient of the 2010 Pioneer Award; Home to unique treasures such as an awardwinning Culinary Arts Department, featured in the documentary “Pressure Cooker” and on The Rachael Ray \r\nShow in May 2010; Home to the only functioning pipe organ in The School District of Philadelphia.", "attendance_time": 0, "locationnumber": "7010", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 49, "name": "Frankford High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Anime Club, Band, Chess, Cultural Club, Dance, Debate, Drama, Guys Read Club, JROTC, National Honor \r\nSociety, Recreation Club, Red Cross Club, Science Club, Student Government", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Warren E. Smith (WES) behavioral health organization, Methodist Service homework and community \r\nservice program, Frankford Group Ministry, Mazzoni Center, Communities in Schools of Philadelphia, White \r\nWilliams Scholars, Philadelphia Futures, College Map sponsored by Ernest and Young, Temple University \r\nUpward Bound Program"}}, {"pk": 18, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Benjamin Franklin High School is a unified learning community that is committed to ensuring the \r\neducational development of all students so that they may become successful and socially responsible \r\nindividuals in the 21st century.  We prepare students to be thinkers in a global context, preparing our \r\nstudents for admission to and graduation from a four-year postsecondary program.", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Culinary Arts\r\nDual Enrollment Program\r\nPrograms: Arts; Bio-Technology; Navy JROTC; SAT Preparation", "sports": "Co-ed Crew, Football, Cheerleading, Boys’ Tennis, Boys’ Cross Country, Girls’ and Boys’ Basketball, Girls’ \r\nVolleyball, Badminton, Baseball, Softball, Boys’ Track", "other": "", "grading_style_c_num": 0, "pride": "Seven straight years of academic growth in PSSA Testing; Cultural diversity and awareness of student \r\ncommunity; Highly Qualified teachers of diverse backgrounds; Wireless internet access computer labs; Only \r\nNavy JROTC in The School District of Philadelphia.", "attendance_time": 0, "locationnumber": "2010", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 53, "name": "Benjamin Franklin High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Art Club, Choir, Debate Team, Drama Club, Magazine, Newspaper, National Honor Society, Photography, \r\nRobotics, Student Government", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Philadelphia Educational Fund, Philadelphia Academies, Nu Sigma Youth Services, Temple University, Drexel \r\nUniversity, Amongst Men Mentoring, Motivos, Play – it – Smart, Social Work Connection, Navy JROTC, \r\nLegacy Program, College Access, White Williams, Upward Bound, Freedom Schools"}}, {"pk": 19, "model": "philly.school", "fields": {"essay": false, "pssa_math": 1, "essay_topic": "", "mission": "Franklin Learning Center is a criteria-selected magnet school with a site-selected faculty.  The mission of the \r\nFranklin Learning Center is to provide a multi-cultural environment that emphasizes the areas of health, \r\ntechnology, the arts and humanities in preparation for college.  Students work on a “competency-based” \r\nsystem of study that requires them to master each subject through a step-by-step program of study enhanced \r\nby real world learning", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Business Technology; Health Professions (HRT)\r\nAdvanced Placement Courses:  Biology; Calculus; Computer Science; English Language and Composition; \r\nEnglish Literature and Composition; Physics; Studio Art Drawing  \r\nDual Enrollment Programs: Community College of Philadelphia; Drexel University; Eastern University; \r\nUniversity of Pennsylvania\r\nPrograms: Art; Dance; Drama; Humanities/Liberal Arts; Vocal and Instrumental Music", "sports": "Coed Cross Country, Soccer, Girls’ and Boys’ Varsity Basketball, Cheerleading, Girls’ and Boys’ Varsity \r\nVolleyball, Baseball, Softball, Coed Track and Field, Intramural Dance", "other": "Audition or Portfolio presentation required for Arts Majors.", "grading_style_c_num": 1, "pride": "State Level Distinction for Mock Trial; National School of Excellence; Reached AYP for five consecutive years; \r\nBoys’ Basketball PIAA District XII AAA /winners; State Finalists in HOSA Competitions; won the Philadelphia \r\nStock Market Competition. ", "attendance_time": 1, "locationnumber": "2290", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 0, "name": "Franklin Learning Center", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Asians Club, APSIRA Club, Drama Club, Future Business Leaders of America, HOSA, Mock Trial, National \r\nHonor Society, National Language Exam Prep, Poetry Club, Red Cross Club, Reflections Literary Magazine, \r\nScience Fair Club, Student Government, Yearbook Club", "school_type": 2, "national_norm": 75, "invite_only": false, "partnerships": "Health Science partnerships; Humanities partnerships; Communications partnerships; Computer and Business \r\npartnerships; Performing Arts partnerships; local universities and law firms; student internships"}}, {"pk": 20, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Our goal at Furness High School is to provide a culture of success that focuses on developing students \r\ninto leaders who are equipped with the key 21st century skills of critical thinking, problem solving, selfempowerment and multicultural competence, in order to excel academically and as community leaders", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Hotel, Restaurant, Travel and Tourism Academy\r\nAdvanced Placement Courses: Calculus; Chemistry; English Literature and Composition; Government; Physics, \r\nUS History\r\nPrograms: Information Technology Academy, Urban Education Academy, Chinese Heritage Language, Spanish \r\nHeritage Language, Read 180 and Reading Edge Reading Intervention Programs", "sports": "Football, Cheerleading, Golf, Girls’ and Boys’ Soccer, Basketball, Badminton, Baseball", "other": "", "grading_style_c_num": 0, "pride": "Freshmen Seminar – Career Choices Program; Three new computer labs; 20 Classrooms of the Future – \r\nPromethean Technology", "attendance_time": 0, "locationnumber": "2160", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 48, "name": "Horrace Furness High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Choir, Credit Recovery Program, Debate Team, Drama Club, Grade Improvement Program, Homework \r\nZone, Literary Magazine: “The Peregrine,” National Honor Society, SAT Preparation, Science Club, Student \r\nGovernment, School Newspaper: “The Falcon", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "ASPIRA Youth Leadership Development Program, Build-On After School Program, ELECT, OST – Beacon \r\nProgram - United Communities of Southeastern PA, Project Pride Peer Mediation Program, Philadelphia \r\nStudent Union Chapter, Variety Club After School Beacon Program"}}, {"pk": 21, "model": "philly.school", "fields": {"essay": false, "pssa_math": 1, "essay_topic": "", "mission": "GAMP is committed to the continued development of an educational environment in which all learners \r\nsucceed.  Reflecting on our own collective knowledge and the research on the best instructional practices, we \r\nenvision that the educational climate will be cooperative, interactive, rigorous in standards, and responsive to \r\nthe diverse needs of learners.", "grading_style_c_time": 1, "highlights": "Advanced Placement Course: Music Theory\r\nCommunity College of Philadelphia Course Credits offered each year (Junior/Senior) to all GAMP students \r\n(Courses are taught two times weekly at GAMP, with 12 possible college credits awarded for four semesters.)", "sports": "Boys’ Basketball; Girls’ Softball; Co-ed Tennis; Boys’ Baseball; Co-ed Cheerleading", "other": "Applicants must have experience with vocal and instrumental music to be considered. Priority for admission is given to GAMP's current 8th grade class", "grading_style_c_num": 0, "pride": "Winner, February 2009 - 2010, of the National Title I Award for the State of Pennsylvania from among all 501 \r\nSchool Districts; Winner April 2009, High School City-Wide, National Academic League; Winner City Wide \r\nHigh School Cheerleading Competition; small school climate provides rich academic, musical, and social \r\nexperiences for all students; presently titled a Vanguard School", "attendance_time": 1, "locationnumber": "2410", "grading_style_c": 1, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 95, "name": "GAMP - Girard Academic Music Program", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Chamber Ensembles, Concert Band, Concert Choir, Debate Club, Foreign Language Club, Jazz Band, Jazz \r\nCombo, Literacy Club, Marching Band/Color Guard, National Academic League, Orchestra, String Orchestra, \r\nYearbook", "school_type": 2, "national_norm": 80, "invite_only": false, "partnerships": "The Kimmel Center, Mann Music Center Collaborative Education Course Work, “Astral Artists” Presentations \r\nmonthly, Philadelphia Orchestra, Academy of Vocal Arts Collaborative Initiatives"}}, {"pk": 22, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Germantown High School is a community that includes involved parents, teachers, students, alumni, and \r\ncommunity members who provide a safe, welcoming environment for students in which they are engaged in \r\na rigorous learning process.  Germantown’s commitment prepares students to contribute to their academic, \r\ntechnological, and social skills in becoming productive citizens in this global society.  Together we work to \r\neducate and encourage our students to become motivated, healthy, well-rounded, respectful citizens for a \r\ndiverse world.", "grading_style_c_time": 0, "highlights": "Business Technology; Commercial & Advertising and Art (Graphic Design); Culinary Arts\r\nAdvanced Placement (AP) Courses:  Calculus; Chemistry; English Language and Composition; Psychology; \r\nUnited States Government and Politics; United States History\r\nHonors Courses offered in all core subject areas.", "sports": "Football, Soccer, Coed Cross Country, Girls’ and Boys’ Basketball, Baseball, Softball, Coed Track and Field, Tennis", "other": "", "grading_style_c_num": 0, "pride": "Smaller class sizes; Award-winning Culinary Arts Program; Award-winning Arts Club; Academic Internship \r\nProgram; Student Success Center; Summer Bridge Academy; Saturday School Enrichment Program; Mentoring \r\nProgram; Credit Recovery Program; Academies: Communications; Liberal Arts; Health and Science; Success", "attendance_time": 0, "locationnumber": "6020", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 48, "name": "Germantown High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Art Club, Band and Drum Line, Chess Club, National Honor Society, Photography Club, Poetry Club, Rock Club, School Play, Step-It-Up Mentoring Program, Student Government, Yearbook Committee", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Germantown Clergy Initiative (GCI), First United Methodist Church of Germantown (FUMCOG), Education Works Beacon Center, Cliveden, A National Trust Historic Site, Boys & Girls Club of America"}}, {"pk": 23, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Martin Luther King High School is to prepare students to use basic and higher order cognitive \r\nskills to solve everyday problems.  Graduates will demonstrate excellence in essential skills and critical \r\nthinking to become lifelong learners and contributing citizens in a multicultural society.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Automotive Technology; Health Related Technology\r\nAdvanced Placement Courses: Biology; Calculus AB; English Language and Composition; English Literature \r\nand Composition; US History\r\nDual Enrollment Programs: Community College of Philadelphia, LaSalle University (focus on Process \r\nTechnology) Electives offered in Learning Pathways include Visual Arts, Drama, Instrumental and Vocal Music, \r\nROTC, Health and Related Technology, and Social Justice. ", "sports": "Varsity and JV Football, Girls’ and Boys’ Varsity Soccer, Cheerleading (citywide), Girls’ Varsity Volleyball, Girls’ \r\nand Boys’ Varsity Basketball, Boys’ JV Basketball, Varsity Badminton (citywide), Coed Track, Coed Tennis, \r\nVarsity Baseball, Intramural Weight Training ", "other": "", "grading_style_c_num": 0, "pride": "Our diverse and exciting programs and the shift in student behavior and attitudes is a testament to the \r\nchanging culture of King: Sharp decline in serious incidents and chronic truancy; Rising attendance rates for \r\nboth staff and students; Many enriching cultural activities and programs including the Jacksonville Mass Choir, \r\nthe Philadelphia Orchestra concerts, intriguing speakers and artists, and an engaging and committed faculty.  \r\nKing is becoming a school of choice and opportunity; a school where students “want” to go.  Together, the King \r\nFamily – the administrators, our outstanding faculty, our experienced school police and climate manager, our \r\npartners with Foundations, Inc., and all of our support staff – have worked to create and foster this culture of \r\nchange.", "attendance_time": 0, "locationnumber": "6060", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 48, "name": "Martin Luther King High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Environmental Club, National Honor Society, Teens Go Green, Spanish Club, Drum Line, Drill Team, Drama \r\nClub, Choir, Instrumental Band, JROTC (Army)", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Foundations, Inc., is our Educational Management Organization and our partner in the educating of our \r\nstudents. Weaver’s Way Co-Op, to develop an urban farming initiative, complete with a student-run farm, a \r\nproduce entrepreneurship program, and a fully functioning greenhouse.  Our Job Resource & Development \r\nCenter (JRDC) provides job skill training and placement for our students. The Mural Arts Program of \r\nPhiladelphia works with King student-artists to add to our collection of murals in the halls and on the \r\nwalls of King.  We welcomed the Philadelphia Orchestra for the 3rd consecutive year to celebrate our King \r\nDay of Service.  We offer an online, computer-based program to help students recover missing credits and \r\ncourses.  We also partner with Enon Tabernacle Baptist Church, Teen Elect/MARS, Legacy, Gear-Up, Einstein \r\nHospital, Jefferson Hospital, Will’s Eye Institute, Urban Tree Connection, AAA, Pep Boys, and AutoZone"}}, {"pk": 24, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Lamberton High School is to holistically educate our students to write effectively, \r\ncommunicate fluently, problem solve accurately, and use current technology proficiently, while preparing our \r\nstudents to excel in college level courses through rigorous instruction with appropriate supports.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Calculus; English Literature and Composition; US History\r\nDual Enrollment Program: Saint Joseph’s University\r\nAdvanced and Honors classes offered", "sports": "Girls’ Volleyball, Boys’ Basketball, Badminton, Baseball", "other": "", "grading_style_c_num": 0, "pride": "Dual Enrollment; Community Service; Credit Recovery; Grade Improvement; Classrooms for the Future; School Mentoring Program; Student Government; Athletic Teams, National Honor Society; 25 Book Challenge", "attendance_time": 0, "locationnumber": "4330", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 76, "name": "Robert E. Lamberton High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Anime Club, National Honor Society, Student Government", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "LINKS, BEBASHI, Northern Homes, Saint Joseph’s University"}}, {"pk": 25, "model": "philly.school", "fields": {"essay": false, "pssa_math": 2, "essay_topic": "", "mission": "The mission of the High School of the Future is to provide a stimulating 21st Century curriculum which will \r\nprepare graduates for the global marketplace.  Technology and partnership are at the core of our mission.", "grading_style_c_time": 0, "highlights": "AP courses: Psychology, English Literature, Calculus, Biology\r\n", "sports": "Football, Cheerleading, Co-ed Cross Country, Girls’ and Boys’ Basketball, Bowling, Girls’ Volleyball, Baseball, \r\nSoftball", "other": "", "grading_style_c_num": 0, "pride": "70% graduation rate and 100% college acceptance rate;  Zero tolerance for bullying, harassment, and violence; \r\nFirst “Farm-to-School” site in the District, using local fruit and produce to prepare fresh breakfast and lunch; \r\nfull athletic offerings; extensive opportunities in the arts; digital music studios", "attendance_time": 1, "locationnumber": "0", "grading_style_c": 0, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 74, "name": "High School of the Future", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Academic Support, Arts and Crafts, Band, Beta Tech Club, Choir, Dance, Debate Team, Drum Corps, \r\nInstrumental Lessons, Jazz Ensemble, Microsoft Digigirls, Orchestra, Theater Productions, Verizon Leadership, \r\nWeight-lifting", "school_type": 1, "national_norm": 88, "invite_only": false, "partnerships": "The University of Pennsylvania, Villanova University, Lincoln University, Fairmount Park Commission, Urban \r\nNutrition Initiative, Microsoft, The Food Trust, Belmont Mansion, The President’s House, National Liberty \r\nMuseum, The Pennsylvania Horticultural Society"}}, {"pk": 26, "model": "philly.school", "fields": {"essay": false, "pssa_math": 2, "essay_topic": "", "mission": "Lankenau High School is a place where all students can achieve at high levels and acquire skills that will help \r\nmaximize potential in a safe and supportive environment.  This will be accomplished through excellence in \r\nteaching and learning in partnership with family and community.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: English Language and Composition; English Literature and Composition; \r\nUS Government and Politics; US History\r\nDual Enrollment Programs: Chestnut Hill College\r\nCourses offered in Environmental Science 1 and 2", "sports": "Students participate in the athletic programs offered by Germantown High School", "other": "", "grading_style_c_num": 0, "pride": "Strong college bound program; Small, country-like setting; Environmental Science Focus; Keystone Award for \r\nconsecutive years of AYP; 90% of students go on to 4-year colleges;  Certified Home and School Association; \r\nPartnership with Chestnut Hill College and Schuylkill Nature Center; Annual Career Day; Technology Fair \r\nAwards; In-house Environmental Science Fair;  Music courses offered.", "attendance_time": 0, "locationnumber": "650", "grading_style_c": 0, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 85, "name": "Lankenau High School", "behavior_time": 0, "pssa_reading": 2, "extracurriculars": "Botany Club, Newsletter Club, Recycling Club, Spirit Club, Student Government, Yearbook Club, Yoga Club; \r\nPoetry Club; Recycling Club; Technology Club", "school_type": 2, "national_norm": 70, "invite_only": true, "partnerships": "PAEP-Artist-in-Residence Program, Schuylkill Nature Center, Chestnut Hill College"}}, {"pk": 27, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Kensington Creative and Performing Arts High School is to provide our students with a \r\nrigorous academic program and comprehensive educational experiences in a safe, supportive learning \r\nenvironment which will prepare students for postsecondary studies, careers, and opportunities in the fields of \r\nthe expressive arts. ", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Cinematography, Film & Video Production\r\nAdvanced Placement Courses: English Literature and Composition; Environmental Science; Government; \r\nCalculus\r\nProgram: Creative and Performing Arts (dance, theater, vocal and instrumental music, visual art)", "sports": "Boys’ Soccer, Girls’ and Boys’ Volleyball, Girls’ and Boys’ Basketball, Boys’ JV Basketball, Wrestling, Bowling, \r\nBaseball, Softball, Badminton (Citywide),  JV Football", "other": "", "grading_style_c_num": 0, "pride": "LEEDS Platinum Certification; 80% of AYP Targets Met; Citi-Post Secondary Success Grant creating a \r\nCollege Going Environment; Monthly service learning and project-based learning days; Student artwork and \r\nphotography shown at local galleries; Arts performances, concerts, and shows throughout the year; Active \r\nstudent leadership council; Comprehensive Introduction to the Arts curriculum for 9th grade students; annual \r\nSpirit Week; Peer Mentoring program; State of the art technology in all academic classrooms; New arts facilities", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 42, "name": "Kensington High School Multiplex: Creative and Performing Arts ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "African Drumming and Dance, Anime Club, Choir, Cinematography,  Dance, Drumline, GSA, Peer Mediators, \r\nPoetry Club, Salsa Club, Senior Class Executive Board, Songwriting Club, Student Government, Theater, \r\nYearbook", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "College Access Program, City Year, Mid Atlantic Coalition of Essential Schools, Philadelphia Education Fund, \r\nDelaware Valley Green Building Council, Earth Force, Urban Tree Connections, Communities in Schools \r\nof Philadelphia ELECT and MARS Programs, Citi Post-Secondary Success Grant, Kensington School and \r\nCommunity Coalition, Project Pride, CADE, Keys to Success, Mobius Math, Youth United for Change"}}, {"pk": 28, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Abraham Lincoln High School is the only All-Academy High School in Philadelphia. Our mission is to \r\nprovide a rigorous academic program that challenges and inspires our culturally diverse population in \r\na positive and safe environment enabling our students to realize academic and career potential, while \r\npromoting successful, productive, and responsible members of society. Our vision is to educate all students \r\nfor college, career, technology or service opportunities.", "grading_style_c_time": 0, "highlights": "The ninth grade Success Academy structures academic core content courses to assist students in making \r\nsmooth transition in a large comprehensive High School. In grades 10, 11 and 12, in addition to core content \r\ncourses,  students select an academy  including; Accounting, Business and Technology, Law and Government, \r\nEnvironmental Science, Business and Office Technology, Health Related Sciences, Horticulture and Fine and \r\nPerforming Arts and Airforce Junior ROTC to provide them with experience in select fields they may wish to \r\nfocus on for post secondary opportunities. Our Advanced Placement English Literature, Advanced Placement \r\nEnvironmental Science, Advanced Placement Calculus and Advanced Placement Government and Law are \r\noffered to students who excel in academic areas. Furthermore, each grade at Lincoln has class officers elected to \r\nplan various activities to promote school spirit.", "sports": "FALL: Cheerleading/Co-ed, Field Hockey/Females, Football/Males, Junior Varsity Football/Males, Golf/Co-ed, \r\nSoccer/Males, Junior Varsity Soccer/Males, Tennis/Females and Volleyball/Females\r\nWINTER: Basketball/Males, Junior Varsity Basketball/ Males, Basketball/Females, Junior Varsity/Females, \r\nBowling/Co-ed, Cheerleading/Co-ed, Swimming/Co-ed, Wrestling/Males, Weight Training/Co-ed Intramural\r\nSPRING: Badminton/Females, Baseball/Males, Junior Varsity Baseball/Males, Lifeguard Training/Coed Intramural, Softball/Females, Tennis/Males, Track/Co-ed, Volleyball/Males, Weight Training-Co-ed \r\nIntramural", "other": "", "grading_style_c_num": 0, "pride": "Lincoln students have attended all major universities including NYU, University of Pennsylvania, Harvard, \r\nTemple and Villanova; Over one thousand graduates selected military careers providing service to our country; \r\nOver thirty thousand graduates, with an over twenty five thousand member Alumni Association; From 2009 to \r\n2012 we accessed a 5.8 million dollar Department of Labor Career Connection Grant; Six mobile laptop carts; \r\nall classrooms equipped with Interactive Smart Boards and multi-media projectors funded by Classrooms of the \r\nFuture; Foreign Language Acquisition grant money utilized for Chinese Language and Culture classes", "attendance_time": 0, "locationnumber": "8010", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 48, "name": "Abraham Lincoln High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "In addition to Grade Improvement and Credit Recovery Lincoln offers a Chinese Language class for Parents and \r\nthe following extra-curricular activities for students: Chess Team, Mock Trial Teams, Future Business Leaders \r\nof America, Future Farmers of America, Junior National Association for the Deaf, The Lincoln Log Student \r\nNewspaper, National Honor Society, Aesthetic Asian Association, Railsplitters Yearbook Committee, Junior \r\nand Senior Prom Committee, Red Cross Club, Gay/Straight Alliance, Anime Club, Concert Band, Marching \r\nBand, Varsity Singers, Jazz Band, Chamber Choir, Madrigal Ensemble, Brass Ensemble, String Ensemble, \r\nIndividual and Small Group Lessons, Show Chorus, Drama, Dance and Barbershop Quartet", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Department of Labor, Dual Enrollment at Manor Junior College and Holy Family College, Philadelphia \r\nAcademies, Department of Labor, Education Works, Devereaux, Social Work Connection, Citizens Bank and \r\n1199C Healthcare Workers Union Training and Education."}}, {"pk": 29, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Mastbaum is to provide equal opportunities for all students to achieve at high levels in order \r\nto develop the necessary academic, vocational and technical skills and attitude in order to have the option of \r\npursuing higher education or entering the workforce. Our motto is that we “Educate to Elevate.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs of Study: Automotive Mechanics; Business Technology; Carpentry; Culinary Arts/\r\nHotel, Restaurant & Tourism; Electrical Technology; Commercial & Advertising Art (Graphic Design); Health \r\nRelated Technology -Certified Nursing Assistant; Welding\r\nAdvanced Placement Courses: English Literature & Composition; Environmental Science; United States \r\nGovernment", "sports": "Varsity and JV Football, Girls’ Varsity Soccer, Boys’ Soccer; Girls’ Varsity and JV Volleyball; Cheerleading \r\n(citywide); Girls’ and Boys’ Varsity and JV Basketball, Bowling, Badminton, Varsity and JV Baseball; Boys’ \r\nVarsity Volleyball, Co-ed Track and Field, Varsity Softball", "other": "", "grading_style_c_num": 0, "pride": "Award winning Graphic Design program; Nationally recognized Health Occupation Student Association \r\nChapter; Industry recognized & approved certifications in Career and Technical Education (CTE); Annual \r\nCTE awards celebration; Annual Honors Assembly; Department of Labor Youth Rules Ambassadors; Annual \r\nMastbaum Alumni Day; University of Pennsylvania Distributed Leadership Grant; Accreditation through the \r\n“Commission on Secondary Schools of the Middle States Association;” Member of the “Southern Regional \r\nEducation Board” (SREB)", "attendance_time": 0, "locationnumber": "5060", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 67, "name": "Jules E. Mastbaum Technical High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "ASPIRA, Choir, Health Occupation Students of America (HOSA), National Honor Society, Mastbaum Alumni \r\nAssociation, Project Pride-Peer Mediation & Leadership, Senior Residency, Skills USA, Student Government, \r\nYearbook Committee", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Lockheed Martin, Philadelphia Academies, Inc., Philadelphia Electric Company, Philadelphia Youth Network, \r\nTemple University Nurses’ Association, Youth United for Change, Automobile Dealers Association of Greater \r\nPhiladelphia, White-Williams Scholars, Charles Ellis Fund, Community College Tech-Prep Pennco Tech \r\nSEPTA-South"}}, {"pk": 30, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Our mission is to prepare students for post-secondary studies, careers and apprenticeships by offering a \r\ncore of rigorous academic courses integrated with a challenging career program major in a safe, supportive \r\nlearning environment.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Biology; English Literature and Composition; Government\r\nDual Enrollment Program\r\nPrograms: Culinary Arts; Health Related Technology", "sports": "Soccer, Girls’ Volleyball, Boys’ Volleyball, Girls’ and Boys’ Basketball, Boys’ JV Basketball, Wrestling, Bowling, \r\nBaseball, Softball, Badminton (Citywide)", "other": "--", "grading_style_c_num": 0, "pride": "Member of Small Schools Transition Project; Emphasis on both Academic Achievement and Workforce \r\nEducation; Health Related Technologies Program", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 37, "name": "Kensington High School Multiplex: Culinary Arts at the Emerald", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Anime Club, Gay-Straight Alliance, Journalism Club, Prom Committee, Saturday Enrichment Program, Senior \r\nActivities Club, Student Government, Students Run Philly Style, Yearbook Club", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Kensington School and Community Coalition, ASPIRA, Youth United for Change, East Stroudsburg University"}}, {"pk": 31, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Kensington International Business High School is to graduate students prepared for the 21st \r\ncentury, able to compete locally and globally, possessing the skills and attitudes necessary for college and \r\ncareer.  Academic and personal growth experiences focus on graduates developing the skills and attitudes \r\nof  self-confidence, critical thinking, collaborative communication , life-long learning, and academic and \r\npersonal achievement in business and life.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: English Language and Composition; English Literature and Composition\r\nHonors Courses in English and Math, grades 9-12\r\nFirst year of CTE Programs in Business and Journalism: Elective and Business program courses include: \r\nIntroduction to Business; Entrepreneurship; Personal Finance; Investing; Office Technologies; Business \r\nTechnology", "sports": "Boys’ Soccer, Girls’ and Boys’ Volleyball, Girls’ and Boys’ Basketball, Boys’ JV Basketball, Wrestling, Bowling, \r\nBaseball, Softball, Badminton (Citywide), Cheerleading, JV Football", "other": "", "grading_style_c_num": 0, "pride": "We are proud of the “tiger” spirit that helped us achieve: college placements for many of our students, including \r\nCommunity College of Philadelphia, Penn State, Connecticut College, Franklin & Marshall, LaSalle University, \r\nHarcum College, Goldey-Beacom College; being the only school to partner with Deloitte International and \r\nhave the benefit of mentors for 50 students; the interview and networking opportunities students participate in \r\nthanks to Philadelphia Academies partnership; being one of four high schools in Philadelphia to participate in \r\nthe Citi Post Secondary Success Grant to build a college culture;  Meritorious, Distinguished, and High Honors \r\nScholars every quarter; White Williams Scholars", "attendance_time": 0, "locationnumber": "-0", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 36, "name": "Kensington High School Multiplex: International Business, Finance and Entrepreneurship", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Basketball Club, City Year Tutoring, Chess Club, Credit Recovery, Dance Club, Fashion Club, Guitar, Peace \r\nClub", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Deloitte International, Philadelphia Academies, Entrepreneurship Center, Philadelphia Education Fund, \r\nPhiladelphia Youth Network, Coalition of Essential Schools, City Year, Citi Post Secondary Success Grant, \r\nCommunity College of Philadelphia, Lincoln University, Temple University Fox School of Business, University \r\nof Pennsylvania Wharton School of Business"}}, {"pk": 32, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "To Prepare future educators to be competent in all Content Areas and to teach in Urban Schools.\r\nKensington Urban Education Academy shall be a community nurturing academic excellence for all students \r\nand demonstrating leadership in character development. This vision statement is intended to serve as both \r\nthe blueprint for improvement and the benchmark by which we will evaluate our progress.\r\nOur Vision is to provide a place where students feel comfortable, safe and accepted, promote open \r\ncommunication between parents, teachers, students which encourages a sense of teamwork and cooperation \r\nand focus on increased student achievement with instructional methods that reflect current research and \r\nproven effective classroom practices.\r\nWe work as a team to create conditions that promote student success.  We encourage colleagues and students \r\nin an atmosphere of support and respect, model professionalism through personal integrity, commitment, \r\nand ethical behavior and collaborate to improve student learning (instructional strategies, methods, and \r\nassessments).", "grading_style_c_time": 0, "highlights": "--", "sports": "--", "other": "--", "grading_style_c_num": 0, "pride": "Kensington Urban Education School will train students to become teachers in the hard to staff areas for the \r\nSchool District of Philadelphia in the STEM areas (Science, Technology Engineering and Math ) and ESOL.", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Kensington High School Multiplex: Urban Education Academy", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Extracurricular activities includes all Kensington Sports, Student Government, Glee Club, Art Club, Dance \r\nClub, and an after-school enrichment program", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "--"}}, {"pk": 33, "model": "philly.school", "fields": {"essay": false, "pssa_math": 2, "essay_topic": "", "mission": "Masterman provides an accelerated, enriched curriculum for academically talented students who are \r\ninterested in a college preparatory experience.  Masterman’s motto is “Dare To Be Excellent.”  To that end, \r\nstudents participate in a rigorous academic program supported by a wide range of co-curricular activities.  \r\nAt Masterman, academic excellence and personal growth take place in a genuinely diverse community.  \r\nOur students learn in and from this diverse atmosphere, truly experiencing and honoring the differences.  \r\nMasterman promotes not simply tolerance, but the rich possibilities for individual and community growth.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses:  Calculus AB and BC; Computer Science; English Language and Composition; \r\nEnglish Literature and Composition; Environmental Science; French Language; Music Theory; Spanish \r\nLanguage; Statistics; US Government and Politics; US History; opportunities for independent study for \r\nadditional Advanced Placement exams.\r\nDual Enrollment Program:  Community College of Philadelphia", "sports": "Girls’ and Boys’ Cross Country, Girls’ and Boys’ Soccer, Girls’ and Boys’ Tennis, Girls’ and Boys’ Volleyball, \r\nBowling, Co-ed Indoor Track, Girls’ and Boys’ Basketball, Co-ed Swimming, Badminton, Baseball, Softball, \r\nCo-ed Track", "other": "Successful completion of Algebra I and French I or Spanish I in 8th grade. Priority for admission given to Masterman's current 8th grade students", "grading_style_c_num": 0, "pride": "Most highly ranked school in the state of Pennsylvania as measured by the PSSA’s;  Ranked as a “Top One \r\nHundred Public School” by US News and World Report for the past three years; All courses are advanced; 12 \r\nadvanced placement courses and dual enrollment at local colleges offered; 22 competitive sports teams for both \r\nyoung men and women; Full range of extra-curricular activities including a nationally-ranked chess team,  \r\norchestra, choir, jazz band and a variety of clubs; Very active and involved Home and School Association", "attendance_time": 1, "locationnumber": "2140", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 99, "name": "Julia R. Masterman Laboratory and Demonstration School", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Over 40 extracurricular activities, including Allies, Chess Club, Debate, Mock Trial, Student Government, \r\nUltimate Frisbee, and more", "school_type": 2, "national_norm": 88, "invite_only": false, "partnerships": "Community College of Philadelphia"}}, {"pk": 34, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Martin Luther King High School is to prepare students to use basic and higher order cognitive \r\nskills to solve everyday problems.  Graduates will demonstrate excellence in essential skills and critical \r\nthinking to become lifelong learners and contributing citizens in a multicultural society", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Automotive Technology; Health Related Technology\r\nAdvanced Placement Courses: Biology; Calculus AB; English Language and Composition; English Literature \r\nand Composition; US History\r\nDual Enrollment Programs: Community College of Philadelphia, LaSalle University (focus on Process \r\nTechnology) Electives offered in Learning Pathways include Visual Arts, Drama, Instrumental and Vocal Music, \r\nROTC, Health and Related Technology, and Social Justice. ", "sports": "Varsity and JV Football, Girls’ and Boys’ Varsity Soccer, Cheerleading (citywide), Girls’ Varsity Volleyball, Girls’ \r\nand Boys’ Varsity Basketball, Boys’ JV Basketball, Varsity Badminton (citywide), Coed Track, Coed Tennis, \r\nVarsity Baseball, Intramural Weight Training", "other": "", "grading_style_c_num": 0, "pride": "Our diverse and exciting programs and the shift in student behavior and attitudes is a testament to the \r\nchanging culture of King: Sharp decline in serious incidents and chronic truancy; Rising attendance rates for \r\nboth staff and students; Many enriching cultural activities and programs including the Jacksonville Mass Choir, \r\nthe Philadelphia Orchestra concerts, intriguing speakers and artists, and an engaging and committed faculty.  \r\nKing is becoming a school of choice and opportunity; a school where students “want” to go.  Together, the King \r\nFamily – the administrators, our outstanding faculty, our experienced school police and climate manager, our \r\npartners with Foundations, Inc., and all of our support staff – have worked to create and foster this culture of \r\nchange.", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Martin Luther King High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Environmental Club, National Honor Society, Teens Go Green, Spanish Club, Drum Line, Drill Team, Drama \r\nClub, Choir, Instrumental Band, JROTC (Army)", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Foundations, Inc., is our Educational Management Organization and our partner in the educating of our \r\nstudents. Weaver’s Way Co-Op, to develop an urban farming initiative, complete with a student-run farm, a \r\nproduce entrepreneurship program, and a fully functioning greenhouse.  Our Job Resource & Development \r\nCenter (JRDC) provides job skill training and placement for our students. The Mural Arts Program of \r\nPhiladelphia works with King student-artists to add to our collection of murals in the halls and on the \r\nwalls of King.  We welcomed the Philadelphia Orchestra for the 3rd consecutive year to celebrate our King \r\nDay of Service.  We offer an online, computer-based program to help students recover missing credits and \r\ncourses.  We also partner with Enon Tabernacle Baptist Church, Teen Elect/MARS, Legacy, Gear-Up, Einstein \r\nHospital, Jefferson Hospital, Will’s Eye Institute, Urban Tree Connection, AAA, Pep Boys, and AutoZone."}}, {"pk": 35, "model": "philly.school", "fields": {"essay": true, "pssa_math": 1, "essay_topic": "", "mission": "To provide a comprehensive liberal arts education so that students will learn the process of communicating \r\neffectively, seeking and analyzing information, constructing their own learning, obtaining 21st Century \r\nskill sets, understanding and accepting various cultures, and developing as responsible citizens with global \r\nawareness, acceptance, and appreciation.", "grading_style_c_time": 0, "highlights": "Five Advanced Placement Courses\r\nDual Enrollment Program", "sports": "Students have the opportunity to participate in the varsity and junior varsity comprehensive sports program \r\navailable at Bartram High School.  There are some opportunities for sports activities in the new gym at the \r\nschool.", "other": "", "grading_style_c_num": 1, "pride": "Made AYP for six years; Two Seniors Selected as “Senior of the Month” 2009-2010; Four Teachers are Rose \r\nLindenbaum Awardees; Principal was Rose Lindenbaum Awardee twice and Dr. Marcus Foster Winner; \r\nBuilding Engineer is a Rose Lindenbaum Awardee; One of six schools that offers Arabic as a World Language; \r\ndiverse population with no tolerance issues; international activities and study of global issues; new gymnasium \r\nand lunchroom areas; Provides a ”Summer Bridge Program” for incoming students; Ninety percent of graduates \r\nattend college", "attendance_time": 1, "locationnumber": "1190", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 84, "name": "Motivation High School", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "National Honor Society, Student Government Association, Bully Prevention Program, Peer Mediation Program, \r\nThursday Club Periods, Student Advisory Council, Health and Wellness Council, SIMBA (Safe in My Brothers’ \r\nArms) – a male initiative and DOVE (Daughters of Virtuous Elegance) – a female initiative", "school_type": 2, "national_norm": 0, "invite_only": true, "partnerships": "Upward Bound Programs at University of Penn and Harcum, Philadelphia Futures, Benjamin Wiley \r\nPartnership Program, Cobbs Creek Environmental Center, Project Pride, Drexel University’s Eat Right \r\nProgram, International Rotary Association – Interact Club, ACE Program - Architecture, Construction and \r\nEngineering and internships at Elsevier Publishing Company"}}, {"pk": 36, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Lamberton High School is to holistically educate our students to write effectively, \r\ncommunicate fluently, problem solve accurately, and use current technology proficiently, while preparing our \r\nstudents to excel in college level courses through rigorous instruction with appropriate supports.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Calculus; English Literature and Composition; US History\r\nDual Enrollment Program: Saint Joseph’s University\r\nAdvanced and Honors classes offered", "sports": "Girls’ Volleyball, Boys’ Basketball, Badminton, Baseball", "other": "", "grading_style_c_num": 0, "pride": "Dual Enrollment; Community Service; Credit Recovery; Grade Improvement; Classrooms for the Future; \r\nSchool Mentoring Program; Student Government; Athletic Teams, National Honor Society; 25 Book Challenge", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 76, "name": "Robert E. Lamberton High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Anime Club, National Honor Society, Student Government", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "LINKS, BEBASHI, Northern Homes, Saint Joseph’s University"}}, {"pk": 37, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Northeast High School empowers students to embrace learning as a lifelong process. We strive to foster in our \r\nstudents a respect for all people regardless of race, ethnicity, class, gender, or sexual orientation, for this is the \r\nvery essence of learning in a global community. We work towards preparing our students to be contributing \r\nmembers of our 21st century high-tech society. Our ultimate goal is for our students to become empathetic \r\nleaders within their families, communities, and world. ", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Communications Technology Cluster (includes skills focused on Commercial & \r\nAdvertising Art (Graphic Design); Graphic Communications (Printing Technology); Commercial Photography; \r\nCinematography, Film & Video Production; and Web Design)  \r\nAdvanced Placement Courses: Biology; Calculus; English Literature and Composition; Environmental Science; \r\nMacroeconomics; Physics; Psychology; Spanish Language; US Government; US History \r\nDual Enrollment Programs: Cheyney University, Community College of Philadelphia, Eastern University, \r\nLincoln University, St. Joseph University, University of Science in Philadelphia, Manor College, Holy Family \r\nUniversity, Drexel University, University of Pennsylvania\r\nInternational Baccalaureate Program\r\nPrograms: International/Liberal Arts; Creative and Performing Arts; Academy for Academic English \r\nAchievement; Health and Medical; Space and Aeronautics Magnet Program; 9th Grade Academy; 9th Grade \r\nSuccess Program Extensive Honors and Advanced courses offered.\r\nWorld Languages offered include Spanish, Italian, French, and Chinese.\r\nElectives include Computer/Information Technology and Film & Video Production.", "sports": "Varsity and JV Football, Cheerleading, Co-ed Cross Country, Varsity and JV Field Hockey, Co-ed Golf, Boys’ \r\nVarsity and JV Soccer, Girls’ Tennis, Girls’ Varsity and JV Volleyball, Girls’ and Boys’ Varsity and JV Basketball, \r\nCo-ed Swimming, Wrestling, Cheerleading, Co-ed Bowling, Indoor Track, Badminton, Varsity and JV Baseball, \r\nGirls’ Soccer, Varsity Softball, JV Softball, Boys’ Tennis, Co-ed Track and Field, Boys’ Volleyball, Intramural \r\nFitness Training", "other": "", "grading_style_c_num": 0, "pride": "2008 & 2009 Stock Market Game Regional Champions; 2009 City Debate Team Champions; Philadelphia Chess \r\nTeam Champions; National Academic League Finalist; 2009 Philadelphia Regional PA High School Computer \r\nFair 1st Place winners and state finalists in Curriculum- Based Web Design, Information-Based Web Design, \r\nText-Based Desktop Publishing, Logo Design, and Graphic Design; Northeast’s Megaphone - (numerous \r\nKeystone Press Awards); Communications Technology Tech Prep Program; SPARC Robotics Program; \r\nMulticultural Program; 18 Classrooms of the Future; Annual Broadway Musical Production; Award-Winning \r\nBand and Orchestra Program; Renowned Choir Program; Annual Alumni Day.", "attendance_time": 0, "locationnumber": "8020", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 67, "name": "Northeast High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "A.S.A. (Asian Traditions and Cultures), Library Club, Gay, Lesbian, Bisexual, Transgender Allies, Amnesty \r\nInternational, Clarinet, Flute, and Percussion Ensembles, Concert and Marching Bands,Jazz and Small Jazz \r\nCombos, Saxophone and Brass Quartets, String Ensemble and Quartet, Chess Club, Concert Choir Chamber \r\nChorale, Select Choir, Christian Club, Civil Air Patrol, CPR and First Aid Certification, Cricket, Dance Club, \r\nDebate Club, Drexel Sea Perch Robotics Competition, Drill Team, ELECT Program, Environmental Club, \r\nESOL Drama, IndoPak Club, Interact Club Association, Italian Club, Knot Club, Landscaping Club, Latinos \r\nUnidos Club, Math Club, Megaphone (School Newspaper), Mock Trial Club, Muslim Students Association, \r\nNational Academic League, National Honor Society, Orchestra, Photography Club, Red Cross Club, Robo \r\nHoops Robotics Club, Robotics Competition Club, SADD, School Show, School Website Club, School- toCareer Activities, Set Design, SkillsUSA, South’s Best Engineering Club, SPARC, Spirit Squad, Stage Crew, \r\nString Ensemble, Student Senate, Tech Squad, Teenagers for the 21st Century, Ushers, Video Club, Viking TV,     \r\nYellow Ribbon", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "International Center for Leadership in Education (ICLE), Xerox Corporation, Philadelphia Young Playwrights, \r\nWalnut Street Theatre, International Thespian Society, National Forensic League, Pennsylvania State Forensic \r\nLeague, Temple University LEAP (Law Education and Advocacy Program), Philadelphia Shakespeare \r\nFestival, Pennsylvania Renaissance Fair, Community College of Philadelphia, Manor College, University of \r\nPennsylvania, Drexel University, Penn State University, Temple University, Jeannes Hospital, Drexel University \r\nSchool of Nursing, ITT Technical Institute, Art Institute of Philadelphia, WHYY TV Channel 12, PSTV \r\nChannel 52, WYBE Channel 35 (MIND TV)"}}, {"pk": 38, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "We, the teachers and staff at Rhodes High School, are committed to academic achievement for all students. \r\nIt is our intention to prepare students for college and life after high school socially, emotionally, and \r\nacademically. We approach learning with confidence , passion, and enjoyment.", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Architecture\r\nAdvanced Placement Courses: Biology, US History", "sports": "Field Hockey, Basketball, Softball, Track", "other": "", "grading_style_c_num": 0, "pride": "97% of students accepted to college and post secondary schools; Met reading and math targets two out of three \r\nconsecutive years; Dedicated teachers and support staf", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 47, "name": "E. Washington Rhodes High School - Young Women's Leadership School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Art, Band, Dance, Extended learning opportunities in Reading and Math, GSA, Leadership Development \r\ncourses, Music, Theater, Upward Bound (9th grade)", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Victory Schools, Young Women’s Leadership Network, Villanova University, Girl’s Inc. "}}, {"pk": 39, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Paul Robeson High School for Human Services is one of only eight high schools in the nation to offer \r\npreparation for further study in the field of human services.  Our elective course offerings are designed \r\nto develop the 21st Century skills needed to succeed in post-secondary studies and careers in the human \r\nservices fields and in service to the local and global community.", "grading_style_c_time": 0, "highlights": "Elective courses in Human Services\r\nAdvanced Placement Courses: Calculus; US Government and Politics\r\nApproved CTE Program: Health Related Technology Course", "sports": "Cheerleading, Co-ed Cross-Country, Girls’ and Boys’ Basketball,  Girls’ and Boys’ Track and Field, Intramural \r\nAdvisory Basketball Tournament", "other": "", "grading_style_c_num": 0, "pride": "2011 Girls Track Team -Public League Champions, Track & Field, & Basketball; 2009 Region 7 winners of \r\nthe annual IPO Stock Market Game; award winning Debate & Mock Trial teams; met state Adequate Yearly \r\nProgress goals in 2007, 2008 and 2010; Featured in the Learning Key, Philadelphia Tribune’s April 26, 2011 \r\nedition.", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 88, "name": "Paul Robeson High School for Human Services", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Debate Team, Journalism Club, Mock Trial Team, Student Government, Yearbook Club, Build On Club, Urban \r\nNutrition Initiative’s Cooking Club and Fruit Stand.", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Hospital of the University of Pennsylvania, Summer Search Program, Villanova University Human Services \r\nClub, Robotics Club in partnership with the University of Pennsylvania’s School of Engineering, Penn Medicine \r\nPipeline, The Paul Robeson House."}}, {"pk": 40, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Roxborough High School is committed to designing programs and learning opportunities that promote \r\nacademic and social achievement for all students.  We will focus on building a strong college preparatory foundation that will provide students with the necessary skills and tools to achieve success in college or career.  Roxborough High School students will be prepared to reach their highest potential and positively contribute to our global society.", "grading_style_c_time": 0, "highlights": "ACriteria Based Admissions for Select Programs; Web Design (Communications Academy); Cinematography (Communications Academy); Business Academy (w/ Virtual Enterprise); Dual Enrollment; Advanced Placement Courses (English Literature, English Language, Biology, Chemistry, Environmental Science, Statistics Government, American History); Advanced Math (Pre-calculus and Calculus); Foreign Language (Spanish, Italian); Art; Music; Theatre  ", "sports": "PIAA:  Cross-Country (B/G); Soccer (B); Football (B); Volleyball (G); Cheerleading (G); Basketball (B/G); \r\nSoftball (G); Baseball (B); Track (B/G); Tennis (B); Badminton (G)", "other": "", "grading_style_c_num": 0, "pride": "9th & 10th Grade Honors courses; 6 Mobile Computer Labs with 30 student laptops in each; 10 class size standard computer labs; 19 classroom interactive computer screen white boards; new state-of-the-art TV Studio; 2011 City-wide winners in Animation & Web Design; 2011 City-wide winners in Digital Movie; 2011 City-wide Speech Competition winner; 2011 Stock Market Game winners; Teacher selected for 2011 Dr. Ruth Wright Hayre Teacher of the Year Award – winner of the Academic Division 1 High Schools; Principal nominated for 2011 Lindback Award for Excellence in Leadership; competitive PIAA Athletic teams making playoffs in football, basketball, baseball and cheerleading", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 66, "name": "Roxborough High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Ridge Record (School Newspaper); The Mesak (Yearbook); Student Government; National Honor Society; \r\nChess; Choir; Art Club; Fitness Club;  Urban Sustainability Leadership Academy; Science Club; Robotics ", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Philadelphia Academies Inc.; Philadelphia Education Fund College Access Program; Citi Post-secondary \r\nSuccess Program Communities in Schools (PEF); Devereaux; Education Works; North Light Community \r\nCenter; Communities in Schools; Urban Family Council"}}, {"pk": 41, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "--", "grading_style_c_time": 0, "highlights": "Web Design, Digital and Multimedia:\r\n\r\nWeb Design & Animation focuses on process and development. Three 2-credit elective courses teach \r\nbasic computer usage, html coding, web page design, graphic design, animation creation and cutting edge technologies. A Career Exploration course discusses current employability options.\r\nDreamweaver, Fireworks and Flash (Adobe Creative Suite) are three of the software programs used by students.Flash is one of the most desirable applications available in web design and gaming!\r\nStudents can earn industry-recognized WOW Certifications (Worldwide Organization of Webmasters) as well as ICDL Certification (International Computer Driver’s License).\r\n\r\nCinematography:\r\nThe Cinematography Program surveys a fast-changing technology that has had immeasurable impact on communications, education, business and entertainment. Digital technology and increasing computer power have enabled sound and video to be manipulated much the same as graphics and text to create an explosion of multimedia materials.\r\n\r\nA three-year sequence of electives covers many aspects of TV and film production, journalism, graphic arts, and theater. Hands-on experience with digital video cameras and show production in a state-of-the-art TV studio are basics of the program. A full lab of digital editing computers provides for individual student creation of video projects. The industry-standard software program Final Cut Pro is used.\r\n\r\nProgram graduates are presently working in all areas of the communications industry. A TV sports anchor, movie director, Broadway performer, and several journalists and teachers are among our graduates.\r\n\r\nThis program aims to give practical experience with video tools and prepare you for future employability. Video technology is essential to effective communication!\r\n\r\nBusiness and Technology:\r\n\r\nThe Business & Technology Program prepares students for every facet of the business and technology world and provides skills that will prepare you for college. Students will have the opportunity to earn Microsoft© Specialist Certification, NOCTI Certification, use desktop/web design that relates to business, keyboarding/ word processing, marketing, business management, business communication, digital literacy including, audio, visual and photography, accounting, personal finance, entrepreneurship, and office skills. Current students have paid internships through PECO, Independence Blue Cross, Insurance Society of PA, banks, law firms and city government. Students participate and enter competitions with FBLA (Future Business Leaders of America), The Business Center of Entrepreneurship, Philadelphia Academies Inc., Technology Symposium sponsored by \r\nTemple University’s Fox School of Business & Engineering Dept., and Pennsylvania Economics. Our students have the opportunity to Job Shadow, visit colleges, learn interview skills and have opportunities for various \r\ntrips and scholarships.", "sports": "--", "other": "", "grading_style_c_num": 0, "pride": "--", "attendance_time": 0, "locationnumber": "-0", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 66, "name": "Roxborough High School Career and Technical Education Programs", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "--", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "--"}}, {"pk": 42, "model": "philly.school", "fields": {"essay": false, "pssa_math": 1, "essay_topic": "", "mission": "Our mission is to develop in students an understanding of and an appreciation for the career and leadership opportunities that are available to them in the many fields of agriculture. It is our commitment to cultivate individual abilities to prepare each student for a lifetime of productive academic, vocational and civic endeavors", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Agricultural Production (Large and Small Animals); Food Science; Horticulture \r\n(including Landscape Architecture and Design, Floriculture and Greenhouse Management); Natural resources Management\r\n\r\nAdvanced Placement Courses: English Literature and Composition; Environmental Science; US Government and Politics", "sports": "Girls’ Volleyball, Co-Ed Cross Country, Boys’ Basketball, Co-Ed Bowling, Softball, Baseball", "other": "", "grading_style_c_num": 1, "pride": "Four-year Agricultural Sciences program recognized and honored as one of the top CTE schools by the PA Dept of Career and Technical Education and US News and World Report; Largest Agricultural School in the state with strong partnerships resulting in internships and job placement; Reading scores on the PSSA remain at over 80% and math scores are improving every year.", "attendance_time": 1, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 82, "name": "Walter Biddle Saul High School of Agricultural Science ", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Career Development Activities are offered after school in all areas of Agricultural Sciences; FFA (student \r\nleadership organization), National Honor Society, Outward Bound, Scholarship in Progress (credit recovery, grade improvement, dance, and art classes), Students Run Philly Style, Tutoring in all subjects", "school_type": 2, "national_norm": 70, "invite_only": false, "partnerships": "University of Pennsylvania, Penn State University, Temple University, Community College of Philadelphia, \r\nPennsylvania Horticulture Society, Pfizer Animal Health, Longwood Gardens, Philadelphia Phillies, Weaver’s Way, Middle Atlantic Cooperative, Pegasus Therapeutic Riding Academy, Solly Stables, Philadelphia Parks and Recreation, Philadelphia Zoo, First Tee, VEP summer jobs and Philadelphia Youth Network"}}, {"pk": 43, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Sayre High School’s mission is to provide a comprehensive and challenging educational program that \r\nencourages all students. We believe that every student is capable of achieving at proficient and advanced levels. We encourage them to become critical and creative thinkers with the support of proficient and rigorous instruction by highly qualified teachers. Students are provided with a safe learning environment where they are individually challenged to improve their content knowledge and succeed at becoming lifelong learners.", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Health Related Technology\r\nAdvanced Placement Courses: Calculus; English Language and Composition; US History\r\nHonors courses offered in English and Mathematics.", "sports": "Boys’ Varsity Basketball, Girls; JV Basketball, Bowling, Girls’ and Boys’ Track and Field", "other": "--", "grading_style_c_num": 0, "pride": "Advanced Placement Courses in U.S. History, Calculus, and English Language and Composition; APEX; CTE Health; Health Careers and Technical Education with University of Pennsylvania; Honors Courses in English and Mathematics; Project Grad; PSSA Prep Courses; Sayre Scholars; Study Island; Urban Nutrition Initiative", "attendance_time": 0, "locationnumber": "-0", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 54, "name": "William L. Sayre High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "APEX, Bass and Guitar Club, Conflict Resolution, Diplomacy, Environmental Science Club, Olympic Club, \r\nRussian Club, Senior Activities, Strength and Conditioning, Student Government, Wiffleball, Yearbook", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "AT&T, Classrooms for the Future, Communities in Schools, Project Grad, Teach for America, University of Pennsylvania"}}, {"pk": 44, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "It is the philosophy of the Overbrook High School Community that by exposing all students to a culture of \r\nexcellence and success that all will become responsible, productive citizens.  Through a commitment to high \r\nprofessional standards, high expectations, stakeholder partnerships, all students will adopt the culture of \r\nexcellence being a standard and college a given.", "grading_style_c_time": 0, "highlights": "Programs: Health Medical Technologies, Accounting, Architectural Drafting Auto-CAD, \r\nAdvanced Placement Courses: Calculus; English Language and Composition; English Literature and \r\nComposition; Psychology; US History \r\nScholars Academy", "sports": "Football, Cheerleading, Girls’ and Boys’ Track and Field, Volleyball, Girls’ and Boys’ Soccer, Girls’ and Boys’ \r\nBasketball, Bowling, Badminton, Baseball, Softball", "other": "", "grading_style_c_num": 0, "pride": "Nationally recognized, three-time State Champion Mock Trial Team; Championship Robotics Team, competing \r\nin 2010 in the International MATE Rov Challenge in Hilo, Hawaii; ROTC; Competitive sports teams ", "attendance_time": 0, "locationnumber": "4020", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 52, "name": "Overbrook High School", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Mock Trial, Robotics, Choir, Instrumental, Chess Club, Drama/Dance Club, Steppers, Cheerleading, Student Government", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Education Works, Project Pride, HeartSpeak, Diplomas NOW, Millersville University, Talent Search, \r\nCommunities in Schools, Philadelphia Academies, Villanova University, Bryn Mawr College, St. Joseph’s \r\nUniversity, Kids First"}}, {"pk": 45, "model": "philly.school", "fields": {"essay": false, "pssa_math": 2, "essay_topic": "", "mission": "The Science Leadership Academy is a partnership high school between The School District of Philadelphia and The Franklin Institute.  SLA provides a rigorous, college-preparatory curriculum with a focus on science, technology, mathematics and entrepreneurship. Students at SLA learn in a technology-infused, projectbased environment where the core values of inquiry, research, collaboration, presentation and reflection are emphasized in all classes.", "grading_style_c_time": 1, "highlights": "Dual Enrollment Program: Drexel University, U. Penn Scholars and Community College of Philadelphia\r\n\r\nStreamed courses in 9-11 Grades; 10 and 11 Grade Individualized Learning Plan; 12 Grade Capstone Course.\r\n\r\nCourses offered in Digital Filmmaking, Computer Science Engineering, General Engineering, Art Studio, \r\nDrama/Playwrighting.  ", "sports": "Co-ed Cross Country, Girls’ and Boys’ Soccer, Girls’ Volleyball, Girls’ and Boys’ Basketball, Baseball, Softball, Co-ed Track, Co-ed Ultimate Frisbee (citywide)", "other": "", "grading_style_c_num": 1, "pride": "Partnership with The Franklin Institute including Ninth Grade Program and Franklin Scholars Speaker series which brought Bill Gates to campus in 2010; Named as one of the Ten Most Amazing Schools by Ladies Home Journal in August 2010; Featured in the PBS Documentary, Digital Media: New Learners for the 21st Century; Apple Distinguished School: 2009-2011; Nationally recognized 1:1 laptop program; Gates Millenium Scholars 2010-2011; Featured in Scholastic Administrator Magazine: May 2009; Four year Advisory program; Designed and built a solar distillation system for a hospital in Sierra Leone; Two patents pending for a flow process biodiesel generator; Slam Poetry program, placing student on Philadelphia Youth Slam team; 2011 City Debate Champions; 2010 Division-winning teams: Girls’ Soccer and Softball; Grants from Motor", "attendance_time": 1, "locationnumber": "-0 ", "grading_style_c": 1, "allowed_tardy": 3, "allowed_absences": 3, "grad_rate": 94, "name": "Science Leadership Academy ", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Art Club, Build On!, Chess Club, Debate, Drama, Engineering Club, Gay-Straight Alliance, Improv Comedy, Lit Mag, Math Club, Newspaper, Peer Mediation, Poetry Slam, Science Club, Student Leadership, Tech Club, Yearbook, Yoga, Young Women’s Leadership", "school_type": 2, "national_norm": 75, "invite_only": false, "partnerships": "The Franklin Institute, Drexel University, over 100 organizations partnering for student Individualized \r\nLearning Plans"}}, {"pk": 46, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "South Philadelphia High School is dedicated to providing a quality, comprehensive educational program \r\ndesigned to address the unique needs of a diverse student population. Our mission is to provide a quality education for all students, one that develops the content knowledge, skills, and attitudes that will enable students to reach their maximum potential as responsible, productive citizens and life–long learners. Our students will have the skills and knowledge to participate meaningfully in a multicultural, technological, and change-oriented society. ", "grading_style_c_time": 0, "highlights": "Approved CTE Programs of Study: Culinary Arts; Computer Systems Technology (Cisco Program)\r\nPrograms: Law & Medicine; Hospitality & Tourism (NAF Academy).Advanced Placement Courses: Calculus; English Literature and Composition; US History Dual Enrollment Program", "sports": "Football, Cheerleading, Cross Country, Boys’ Soccer, Girls’ Volleyball, Bowling, Girls’ and Boys’ Basketball, Badminton, Baseball, Softball, Boys’ Volleyball, Track and Field", "other": "", "grading_style_c_num": 0, "pride": "National Honor Society-One of the first 10 chapters in the United States; 2 First Place prizes in City-Wide Computer Fair-Competed at the State level; Chinese New Year/Multicultural Celebration; Asian American Educator Essay Contest Winner; School Newspaper; Exemplary ESOL/Bilingual program; Participating in nine different grants; Career Day/College Fair; Successful Red Cross Blood Drives; Upward Bound Program at Lincoln University and Philadelphia Community College; Champions of Caring; Active South Philadelphia High School Alumni Association; Teen Court conflict resolution; Culinary Arts Café; Ten (10) computer labs/18 CFF classrooms; Exemplary Education Options Program graduated over 130 students for the past two years; ELECT Program.", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 33, "name": "South Philadelphia High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Beacon After School Activities, Breakdance Club, Chess Team, Drumline, JROTC, National Honor Society, Red Cross Club, School Newspaper, Science Club", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "City Year, Project Bridging Cultures, Beacon/Education Works, TWIS, PAAN, Numerous Colleges, \r\nincluding Jefferson “Docs” Program, Deloitte, Philadelphia Bar Association, Philadelphia Mural Arts \r\nProgram, Claymobile, Communities in Schools, Philadelphia Academies, Inc., Champions of Caring, Greater Philadelphia Cares"}}, {"pk": 47, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of the Strawberry Mansion High School is to develop students to become active lifelong learners and productive citizens in a global society who demonstrate mastery of technology, analytical thinking, and communication skills through excellence in teaching and learning in partnership with family and local communities, in a safe and caring environment.", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Culinary Arts Advanced Placement Courses: English Literature and Composition; Statistics; US Government and Politics", "sports": "Cheerleading, Bowling, Girls’ and Boys’ Track, Baseball, Girls’ Volleyball, Girls’ and Boys’ Basketball, Girls’ and Boys’ Cross-Country", "other": "", "grading_style_c_num": 0, "pride": "US News and World Report 2009-2010 Bronze Medal Winner; United Nations of Philadelphia Partnership; University Partnerships; Young Playwrights Winners; Robotics; Student Book Club; Student Newspaper / Journalism; Urban Nutrition Initiative; Award Winning Culinary Arts Department", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 52, "name": "Strawberry Mansion high School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Chess, Mock Trial, Peer Mediation, Teen Court, Yearbook", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "White Williams Scholars, Benjamin Wiley Partnership Program, Philadelphia Chapter of the Links, Inc., \r\nCATCH, Inc., Teen Elect and MARS, College Access, EducationWorks, Philadelphia Futures, PACACGP - \r\nPA Project Grad , Redeem Baptist Church, Temple University, Villanova University, Community College of \r\nPhiladelphia, Swing Phi Swing, Claymobile, Learning for Life"}}, {"pk": 48, "model": "philly.school", "fields": {"essay": false, "pssa_math": 3, "essay_topic": "", "mission": "Our mission is to provide a liberal arts, college preparatory education for all students, as well as to encourage \r\nthe use of the city’s resources to extend personal and professional growth.  Our staff provides a secure \r\nand enriching teaching and learning environment in which all are engaged, encouraged, and nurtured.  \r\nOur parents and guardians join us in fostering academic achievement, personal responsibility, and selfactualization.  We encourage our students to have an appreciation for civic responsibility and to prepare for \r\ntheir future in the 21st Century culture and economy", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Biology; English Literature and Composition; US History\r\nElective courses include Earth Science, Introduction to Technology in the Classroom, Geography, Art, Health \r\nand Physical Education, Contemporary Issues, Drama, SAT Prep English and Math, Multicultural Ethical Issues, \r\nStatistics, Environmental Science, and Personal Finance. ", "sports": "Football, Cheerleading, Varsity and JV Girls’ and Boys’ Basketball, Soccer, Girls’ and Boys’ Volleyball, Baseball, \r\nSoftball, Girls’ and Boys’ Track", "other": "", "grading_style_c_num": 1, "pride": "Student respect for diversity; Excellent student and staff attendance; Surpassed AYP Targets for six consecutive \r\nyears; earned Commonwealth of PA Achievement Keystone Award for six consecutive years; over 90% of  \r\ngraduates enroll in 2-4 year colleges and universities; Classrooms of the Future; Student artwork on display \r\nthroughout school; Annual events, including: PCC Annual Walk for Fitness; Multicultural Awareness Day; \r\nCareer Day, Alumni Day and Constitution/Law Day", "attendance_time": 1, "locationnumber": "5080", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 87, "name": "Parkway Center City High School", "behavior_time": 1, "pssa_reading": 3, "extracurriculars": "Chess, Debate, Graduation Committee, National Honor Society, Prom Committee, Student Government, \r\nTutoring, Yearbook Committee", "school_type": 2, "national_norm": 70, "invite_only": false, "partnerships": "Temple University, University of Delaware, Lantern Theatre, Brandywine Workshop, and OIC of America"}}, {"pk": 49, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of Swenson Arts and Technical High School is to prepare students for careers, apprenticeships, and postsecondary studies by offering challenging academic and career programs in a safe supportive learning environment, empowering students to become lifelong learners and productive members of society.  All Swenson students complete a challenging career program major tied to industry standards with exit assessments and certifications. ", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Auto Collision Repair; Auto Mechanics; Baking; Carpentry; Computer Networking; Culinary Arts; Electrical; Health Professions (HRT); Plumbing; Web Design Programs: Hotel, Restaurant, Travel and Tourism Academy; Academy of Electrical Sciences; Architecture and Engineering Related Technology; Computer Based Digital Media Design Advanced Placement Courses:  English Literature and Composition; US History Dual Enrollment Programs: Community College of Philadelphia; Drexel University; Holy Family University and Manor Junior College", "sports": "Cross Country,t Soccer, Girls’ and Boys’ Basketball, Indoor Track, Baseball, Softball, Girls’ and Boys’ Track, all girls are eligible to participate in girls’ sports at Washington High School.", "other": "", "grading_style_c_num": 10, "pride": "State PIAA Girls Track Championship; Award-winning Culinary program; Recognized by the Pennsylvania State Department of Education as a “Career Center that Works;” International student exchange program; Received Hamels Grant in 2011; 94% student Average Daily Attendance; 97% Average Staff Attendance. Operates Fox Chase Farm as a demonstrtion farm/land laboroatory for the City of Philadelphia.", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 92, "name": "Swenson Arts and Technology High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "American Red Cross Club, Anime Club, Art Clubs, Chess Club, Culinary Competitions, International Cultural Exchange, International Student Exchanges, Instrumental Music Ensemble, Journalism, Mural Arts, Poetry Jam, Prom Committee, SkillsUSA, Robotics, Student Government, Yearbook, DECA", "school_type": 1, "national_norm": 0, "invite_only": false, "partnerships": "Philadelphia Academies, Greater Northeast Chamber of Commerce, industry and business partners including the Association of Architects, Engineers and Contractors through their ACES Program, corporations, trade and union training centers, City of Philadelphia Agencies; Hamels Foundation; District Council 21; Lockheed Martin Corporation."}}, {"pk": 50, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Our mission is to graduate all of our students on time ready for college, career and citizenship. We work to accomplish that mission through our small learning communities where we build a personalized approach to learning, summer-bridge program for incoming 9th grade students, paid internships through the Department of Labor Grant, and partnerships with organizations ranging from Glaxo-Smith Kline to the Academy of Natural Sciences and from the University of Penn to Drexel University", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: Biology; Calculus AB; Chemistry; English Literature and Composition; \r\nEnvironmental Science; European History; Psychology; Statistics; US Government and Politics; US History\r\nAnthropology course co-taught with faculty from University of Pennsylvania. Elective courses offered in Green Initiatives, drama, art, and music. ", "sports": "Football, Cheerleading, Co-ed Cross Country, Girls’ and Boys’ Volleyball, Girls’ and Boys’ Soccer, Girls’ and Boys’ Varsity and JV Basketball, Bowling, Swimming, Girls’ and Boys’ Track and Field, Baseball, Softball, Badminton", "other": "", "grading_style_c_num": 0, "pride": "Promise Academy under Dr. Arlene Ackerman with the challenge of dramatically improving student \r\nachievement.; Department of Labor Grant to change the culture and level of preparation for our students; Partnerships with community organizations and universities.; Mentoring program for all ninth grade students.; Music programs including both vocal and instrumental arts; Literary program including newspaper, yearbook and literary magazine; Athletic teams competing in a variety of sports each season; 11 Advanced Placement Courses; Advanced math curriculum leading to AP Calculus AB/BC; Over 25 Extra-Curricular programs throughout the year.", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 46, "name": "University City High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Art Club, Band, Career Choices, Chess Club, Choir, Double Dutch, Drama Club, Intramural Sports, Literary Magazine, Mentoring, Mock Trial, Newspaper, Robotics, Student Government, Urban Nutrition Initiative with school garden, Yearbook", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Philadelphia Education Fund, Glaxo-Smith-Kline, University of Pennsylvania, Drexel University, The College Board, Coalition of Essential Schools, National Career Academy Coalition, Enterprise Center, Communities in Schools, Education Works, The Netter Center, Academy of Natural Sciences, Met Inc, Center for Secondary School Redesign "}}, {"pk": 51, "model": "philly.school", "fields": {"essay": false, "pssa_math": 1, "essay_topic": "", "mission": "The school prepares students to face a complex world with the skills necessary to institute positive change \r\nlocally and globally. Our school offers a rigorous college preparatory program designed to promote peace and \r\nsocial justice through the use of critical thinking, problem solving, cooperative learning, and research. ", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: English Literature and Composition, American History, and Studio Art (2D)\r\nDual Enrollment Program", "sports": "Girls’ Varsity Field Hockey, Girls’ and Boys’ Varsity Basketball, Boys’ JV Basketball, Co-ed Cross Country, Coed Tennis, Varsity Football and Baseball Germantown Partnership Teams", "other": "School and/or community volunteer hours and personal interview required.", "grading_style_c_num": 1, "pride": "2008-2009 Title I Distinguished School Award; Student-Driven Service Learning Center; Bi-annual “TeachIn” seminar days; MLK Day of Service participant; 1st Place 2007-08 African-American Oratorical Winner; \r\nmentoring program; placed in Philadelphia Monologue Festival; 92% Daily Attendance Rate; 97% Graduation \r\nRate; above 90% College Acceptance Rate. ", "attendance_time": 1, "locationnumber": "5070", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 86, "name": "Parkway Northwest High School for Peace and Social Justice", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "All Acceptance Alliance, Art Club, Dwight Evans Civic Leadership Summit, National Honor Society, Mock \r\nTrial, Outward Bound, STAR (Students Talking About Relationships), Student Government, and Weavers Way \r\nCO-OP", "school_type": 2, "national_norm": 70, "invite_only": true, "partnerships": "Advisory Board comprised of university and organization partners, Haverford College Fellow, Champions \r\nof Caring, Weavers Way, Pennsylvania Citizens for Children & Youth (PCCY), Temple Youth Voices, Penn \r\nLiteracy, Young Playwrights, Philadelphia Theater Company, and Earth Force"}}, {"pk": 52, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "Our mission is to provide a college preparatory academic program that challenges our students to reach \r\ntheir maximum potential. We provide an environment of excellence, responsibility, diversity, and safety, \r\nfostering intellectual and social growth, and the utilization of technological skills. Through structured \r\nlearning experiences and parental support, we engage all stakeholders in the process of continuous school improvement. All members of the Vaux community are valued and share in the decision making process to work towards one goal: everything that we do is directly aligned with student success!  ", "grading_style_c_time": 0, "highlights": "Approved CTE Program: Health Professions (HRT)", "sports": "Cheerleading, Girls’ and Boys’ JV Basketball, Bowling, Co-ed Track, Fencing, Intramural sports program", "other": "--", "grading_style_c_num": 0, "pride": "Caring staff committed to providing engaging learning experiences that will allow students to reach their \r\nmaximum level of achievement; Saturday School Program providing cultural enrichment programs, \r\neducational field trips and partnerships among parents, students and staff; Engaging and highly structured \r\nacademic program encompassing the District’s Core Curriculum, intervention courses, enrichment courses, \r\nand Mastery Learning program for incoming ninth graders; Spanish and French offered in order to promote \r\nglobal awareness, cultural understanding and language acquisition skills; College and Career advising for all \r\nstudents beginning in the ninth grade; Technology labs, computers, and Classrooms for the Future technology \r\navailable; State certified nursing program offered; Intramural Sports Program; Counseling staff and related \r\nservices to assist parents and students; Partnerships with surrounding community", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 42, "name": "Roberts Vaux High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Language clubs, Literary Magazine, National Honor Society, Newspaper, Peer Mediation Program, Poetry Club, \r\nProject Grad, Yearbook", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Community and Higher Education partnerships are being developed in keeping with the Promise Academy \r\nvision."}}, {"pk": 53, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "We believe schools have an enormous impact on children’s lives.  Improving the educational outcomes for \r\nour students requires support from all segments of our community, including parents, caregivers, businesses, \r\nelected and appointed officials, civic and faith based organizations, along with the School District leaders, \r\nstaff, and students.  We believe that Parents are our partners in helping their children learn at their highest \r\nlevels.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Business Technology; Culinary Arts; Sports Marketing and Management\r\nAdvanced Placement Courses: Biology; Calculus; Chemistry; English Language and Composition; English \r\nLiterature and Composition; Physics; US Government and Politics; US History\r\nDual Enrollment Program: Community College of Philadelphia\r\nInternational Baccalaureate Program", "sports": "PIAA, Citywide\r\nVarsity Football, Boys & Girls Varsity Soccer, Boys & Girls Tennis, Girls Varsity Field Hockey, Boys & Girls \r\nLacrosse, Boys & Girls Varsity Basketball, Swimming (Coed) Gymnastics (Coed) Boys & Girls Badminton,  \r\nBoys Varsity Baseball, Girls Varsity Softball, Track & Field (Coed), Bowling\r\nWe also offer Cheerleading, & Weight Training.", "other": "--", "grading_style_c_num": 0, "pride": "Students come from 67 countries; 27 languages spoken; Championship sports teams (City Champions in \r\nSoccer, Football and Wrestling); International Baccalaureate Program; Extensive elective choices and levels;         \r\nNamed #23 in Top 100 Workplaces in the Delaware Valley by Philadelphia Inquirer.", "attendance_time": 0, "locationnumber": "-1", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 67, "name": "George Washington High School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Bio-Technology, Chess, Choir, Culinary Arts, Dance, Fashion Show, FBLA, Literary Magazine (The Lantern) \r\nNational Academic League, National Honor Society, Multicultural Show, Musicals/Dramas, Robotics, \r\nTechnology, Web Design", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "Beacon Center, Morgan Stanley, Dow Jones Corporation, JEVS, JCC Klein Branch, Lutheran Family Services"}}, {"pk": 54, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "At West Philadelphia High School, we rely on one another because our mutual success is the only option. This \r\ntranslates to a school community where both students and staff play an active role in the overall climate and \r\nperformance of the school. We encourage literacy skills, project-based learning and technology integration in \r\nall classes. We believe all students can succeed and we have both in-school and after-school supports in place \r\nto maximize learning for all students.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Auto Mechanics; Business Technology; Multimedia Technology (includes skills \r\nfocused on Commercial & Advertising Art (Graphic Design); Graphic Communications (Printing Technology); \r\nCommercial Photography; Cinematography, Film & Video Production; and Web Design)\r\nAdvanced Placement Courses: English Language and Composition; English Literature and Composition; Human \r\nEnterprise Center: Youth Entrepreneur Success Program, Executive Incubator Program, Summer Business Boot \r\nCamp; University of PA Netter Center for Community Partnerships, Fellowship Farms, Mural Arts, City Year, \r\nOutward Bound, Spiral Q, Philadelphia Academies, Inc., Talent Development", "sports": "Varsity and JV Football, Cheerleading, Co-ed Cross Country, Boys’ Tennis, Varsity and JV Girls’ and Boys’ \r\nBasketball, Bowling, Baseball, Softball, Badminton, Indoor and Outdoor Girls’ and Boys’ Track and Field", "other": "", "grading_style_c_num": 0, "pride": "Urban Leadership Academy: project-based learning community in which students tackle community issues; \r\nAfter-school program in partnership with the University of PA Netter Center for Community Partnerships:\r\nStudent Success Center, Mentoring and Drop-Out Prevention services; One of the only Final Cut Pro Film/\r\nCinematography programs in the School District; The only NATEF certified Automotive Academy in the \r\nSchool District; Nationally competitive EVX Team for contemporary Hybrid vehicles; Internships with City \r\nFleet Management, Water Department, and Philadelphia Parking Authority; Literacy Specialist on staff; paid \r\ninternship program for all qualified seniors; Senior Instructional Leadership Corp; 9th Grade Academy and \r\nmonth-long Summer Bridge to Success program for incoming 9th grade students", "attendance_time": 0, "locationnumber": "-1 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 42, "name": "West Philadelphia high School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Art Club, Athletic Academic Support, Culinary Arts, Drum Line, Entrepreneurship Class conducted at the \r\nWharton School of Business, Paid Internship Program, Peer Mediation, Peer Mentoring, Poetry Club, Senior \r\nLeadership Instructional Corp, Step Team, Student Government, Teen Court", "school_type": 0, "national_norm": 0, "invite_only": false, "partnerships": "--"}}, {"pk": 55, "model": "philly.school", "fields": {"essay": false, "pssa_math": 2, "essay_topic": "", "mission": "Parkway West is a small special admission school. Our mission is to ensure that all students reach their \r\npersonal and academic potential, and become productive citizens and lifelong learners. In partnership with \r\nPhiladelphia Academies, Inc., Parkway offers an Academy of Urban Education program whose mission is to \r\naddress the need for qualified teachers in the city’s schools. The program is designed to introduce students to \r\ncareers in the field of education, while emphasizing the use of technology", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses: English Language and Composition; English Literature and Composition        \r\nDual Enrollment Programs: Community College of  Philadelphia", "sports": "Cheerleading, Girls’ and Boys’ Volleyball, Girls’ and Boys’ Basketball, Softball, Track and Field", "other": "", "grading_style_c_num": 1, "pride": "Made Adequate Yearly Progress in 2007-2009; More than 90% of graduates enroll directly in 2 or 4 year \r\ncolleges.", "attendance_time": 1, "locationnumber": "5090", "grading_style_c": 2, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 82, "name": "Parkway West High School", "behavior_time": 1, "pssa_reading": 2, "extracurriculars": "Book Club, Chess Club, Choir, Dance, Drama, Future Educators of America, Grade Recovery, Journalism, \r\nNational Honor Society, Mock Trial, Poetry Club, Student Government, Tutoring", "school_type": 2, "national_norm": 70, "invite_only": true, "partnerships": "Philadelphia Academies, Inc., Cheyney University, Bryn Mawr College, Haverford College, Penn State \r\nBrandywine Campus, Pennsylvania State University, and Community College of Philadelphia. "}}, {"pk": 56, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The mission of the High School for Business and Technology is to ensure that all students meet their full \r\npotential, realized through a variety of best practices, implementation of standards driven curriculum, \r\ninnovative business and technology courses, and fostering an environment that challenges all students, staff, \r\nparents, and community members to become lifelong learners. We offer a rigorous academic program for the \r\ncollege bound student or for joining the business community directly from high school. ", "grading_style_c_time": 0, "highlights": "Dual Enrollment Program\r\nAP Statistics\r\nHonors Bio - Chemistry", "sports": "Intramural Basketball, Cheerleading, Field and Track, Cross Country, and other sports through partnership \r\nwith Ben Franklin High School", "other": "", "grading_style_c_num": 0, "pride": "Strong emphasis on traditional academic subjects and preparation for college; 100% of students scored \r\nProficient or Advanced on PSSA Writing Assessment; Hands-on experience in the business sector through \r\ninternships, shadowing days, visiting speakers, and field trips; Internships through The School District of \r\nPhiladelphia, Bridges Program, and Glaxo-Smith-Kline; High Average Daily Attendance rates (over 90%) and \r\nstaff attendance rates.", "attendance_time": 0, "locationnumber": "1090", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 76, "name": "Philadelphia High School for Business and Technology", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Mock Trials, Student Government, Tutoring, Web Design, Yearbook", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Bridges Program, Glaxo-Smith-Kline"}}, {"pk": 57, "model": "philly.school", "fields": {"essay": true, "pssa_math": 1, "essay_topic": "", "mission": "The Philadelphia High School For Girls is a public college preparatory school for academically talented young \r\nwomen. Our mission is to provide learning experiences in a safe, nurturing environment that prepare our \r\nstudents for success in college and leadership in their chosen field. We do this by challenging the intellect, \r\nembracing diversity, celebrating leadership, honoring ethical behavior and encouraging participation in the \r\nextracurricular program.", "grading_style_c_time": 1, "highlights": "Advanced Placement Courses: Art History; Biology; Calculus; Chinese Language and Culture; English Literature \r\nand Composition; Environmental Science; Macroeconomics; U.S. Government and Politics; U. S. History;   \r\nStudio Drawing\r\nInternational Baccalaureate Program\r\nExtensive honors courses and electives including Art, Instrumental Music, Vocal Music, and Dance.", "sports": "Field Hockey, Soccer, Tennis, Lacrosse, Badminton, Basketball, Bowling, Swimming, Softball, Volleyball, Track \r\nand Field, Cross Country, Intramural competition: Contest", "other": "", "grading_style_c_num": 0, "pride": "Ranked among the top 5 schools in Philadelphia; 2nd Oldest all girls public school in the country; Recognized \r\nat Silver Level by US News and World Report (2010); Continuously exceeding AYP beginning in 2002; 97% of \r\nStudents attend college, many at top U.S. universities; International Baccalaureate Program and expanding \r\nnumber of Advanced Placement courses; Active chapters in National Honors Societies in Academics, \r\nDance, Foreign Language, Mathematics, Music and Science; Multitude of clubs, traditional activities, and \r\norganizations to address diverse student interests; Active Student Government and Athletic Association; Active \r\nAlumnae Association; Large Scholarship and awards program", "attendance_time": 1, "locationnumber": "6050", "grading_style_c": 1, "allowed_tardy": 0, "allowed_absences": 0, "grad_rate": 85, "name": "Philadelphia High School for Girls", "behavior_time": 1, "pssa_reading": 1, "extracurriculars": "Anime, Art, Creative Writing, Cultural Clubs, Dance, Debate, Eco Recycling Club, Garden Club, Music, Peerto-Peer Tutoring, Service Club, Student Government, Yearbook", "school_type": 2, "national_norm": 75, "invite_only": false, "partnerships": "Parent Teacher Daughter Association (P.T.D.A.), La Salle University, Temple University, Moore College of Art, \r\nUniversity of Pennsylvania, Asia Society, College Board, Hanban, Red Cross, Philadelphia Art Museum, Girls’ \r\nHigh Alumnae Association"}}, {"pk": 58, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The Philadelphia Military Academy is committed to promoting academic excellence through sound \r\neducational principles and practices conjoined with leadership and character building.  Every student will    \r\nbe provided the tools to be successful college graduates and well-rounded citizens.", "grading_style_c_time": 0, "highlights": "Advanced Placement Courses:  English Literature and Composition; U.S. Government\r\nProgram:  Army Junior ROTC\r\nDual Enrollment Program\r\nElectives: Arabic; Robotics; Spanish; Color Guard; Theater; Personal Fitness; Journalism", "sports": "Co-ed Cross Country, Girls’ and Boys’ Varsity Basketball, Girls’ Varsity Softball", "other": "Mandatory summer training; Must agree to abide by the JROTC Cadet Creed, wear the Army JROTC and PMA uniform in the prescribed fashion, and comply with standards of personal appearance", "grading_style_c_num": 0, "pride": "State of the art fitness center; strong Robotics program; participation in the Thanksgiving Day Parade; \r\n90% college acceptance rate for graduating seniors; first place in 2009 and 2010 in JROTC Citywide Drill \r\nCompetition", "attendance_time": 0, "locationnumber": "5050", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 80, "name": "Philadelphia Military Academies - Elverson", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "After School Enrichment Program, Amtrak Explorers Post #0651, Archery, Armed Platoon Drill, Biathlon, \r\nChess, Choir, Color Guard, Fitness Center, Multicultural Club, Raider Team, Red Cross/CPR Training, Robotics \r\nClub, Scrabble, Temple University Upward Bound, Unarmed Platoon Drill, Weight Lifting, Martial Arts", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Drexel University, Temple University, Valley Forge Military College, National Hispanic Institute, Tuskegee \r\nAirmen, Villanova University College of Engineering"}}, {"pk": 59, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "PMA is committed to promoting academic excellence through sound educational principles and practices \r\nconjoined with leadership education training and character building. The approach to learning is to challenge \r\nyoung women and men through rigorous college preparatory and JROTC leadership, education, and training \r\ndesigned to assure that each cadet’s learning, progression, and achievement results in exceptional postgraduate qualifications.", "grading_style_c_time": 0, "highlights": "Program: Army Junior ROTC", "sports": "Basketball, Wrestling, Track and Field \r\nStudents participate in sports programs with Germantown High School. ", "other": "Mandatory summer training; Must agree to abide by the JROTC Cadet Creed, wear the Army JROTC and PMA uniform in the prescribed fashion, and comply with standards of personal appearance.", "grading_style_c_num": 0, "pride": "Routinely places in the top of competitive events, including physical fitness and drill competitions; 92% of \r\nfirst graduating class in 2008 attended postsecondary institutions; 95% of graduating class of 2009 attended \r\npostsecondary institutions.", "attendance_time": 0, "locationnumber": "6070", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 81, "name": "Philadelphia Military Academies - Leeds", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "Academic Challenge Teams, Aviation-related Programs, Band, Chess Club, Color Guard, Community Service \r\nProjects, Debate, Drama, Drill Competition, Journalism Club, Mock Trial, Physical Fitness Teams, Raider \r\nChallenge Teams, Student Government, Summer Leadership Training", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Tuskeegee Airmen, Veterans’ Association, Arcadia University"}}, {"pk": 60, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "The Mission of the Randolph Career Academy is to provide a safe, supportive learning environment in which \r\neducational programs, resources, and experiences will enable students to become confident, responsible, \r\nand productive citizens.  We strive to develop high levels of competence in academic skills; a reciprocal \r\nappreciation of human values, attitudes, and cultures; a fostering of independent thinking; an appreciation  \r\nof individual differences; and an improvement of our technology utilization for the 21st Century.", "grading_style_c_time": 0, "highlights": "Approved CTE Programs: Auto Collision Repair; Auto Mechanic; Construction Trades; Culinary Arts;        \r\nEMT/Fire Academy; Health Professions (HRT); Oral Health; ApplianceRepair/Vending Repair.  \r\nAdvanced Placement Course:  English Literature and Composition\r\nDual Enrollment Program", "sports": "Cheerleading, Co-ed Cross Country, Girls’ and Boys’ Basketball, Bowling, Baseball, Softball, Co-ed Track      \r\nand Field ", "other": "", "grading_style_c_num": 0, "pride": "Success in industry certifications; Industry work experience; Industry occupational advisory boards.", "attendance_time": 0, "locationnumber": "6090", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 80, "name": "A. Philip Randolph Career Academy", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "National Honor Society, Red Cross Club, Student Government ", "school_type": 1, "national_norm": 0, "invite_only": true, "partnerships": "Health Partners, The Salvation Army"}}, {"pk": 61, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Arise Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 62, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Boys Latin of Philadelphia", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 63, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Charter HS for Architecture & Design ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 64, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-5", "grading_style_c_time": 0, "highlights": "-5", "sports": "-5", "other": "", "grading_style_c_num": 0, "pride": "-5", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Community Academy of Philadelphia ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-5 ", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-5"}}, {"pk": 65, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Delaware Valley ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 66, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Eastern University Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 67, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Esperanza Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 68, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Franklin Towne ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 69, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Freire", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "--"}}, {"pk": 70, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Hope", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 71, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Imhotep Institute ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 72, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "KIPP Philadelphia Charter School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 73, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mariana Bracetti Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 74, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Maritime Academy", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 75, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mastery - Lenfest ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 76, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mastery - Pickett", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 77, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mastery - Shoemaker", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 78, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mastery - Thomas ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 79, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mathematics, Civics, and Sciences ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 80, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Mathematics, Sciences, & Tech Community", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 81, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Multi-Cultural Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 82, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "New Foundations Charter School ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 83, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "New Media Technology", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 84, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Philadelphia Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 85, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Philadelphia Electrical & Technology", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 86, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Preparatory Charter of Math, Science, Technology & Careers ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 87, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Sankofa Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 88, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5 ", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Tacony", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 89, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Truebright Science Academy ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 90, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Walter D. Palmer Leadership Learning Partners ", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 91, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "World Communications", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 92, "model": "philly.school", "fields": {"essay": false, "pssa_math": 0, "essay_topic": "", "mission": "-", "grading_style_c_time": 0, "highlights": "-", "sports": "-", "other": "", "grading_style_c_num": 0, "pride": "-", "attendance_time": 0, "locationnumber": "-5", "grading_style_c": 0, "allowed_tardy": 5, "allowed_absences": 10, "grad_rate": 0, "name": "Youth Build Philadelphia", "behavior_time": 0, "pssa_reading": 0, "extracurriculars": "-", "school_type": 4, "national_norm": 0, "invite_only": false, "partnerships": "-"}}, {"pk": 1, "model": "philly.schooladdress", "fields": {"name": "6", "image": "A", "locationnumber": "2", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 2, "model": "philly.schooladdress", "fields": {"name": "0", "image": "A", "locationnumber": "8", "phone": ",", "address_street": "4", "address_zip": "0"}}, {"pk": 3, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "1", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 4, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "5", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 5, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "2", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 6, "model": "philly.schooladdress", "fields": {"name": "4", "image": "\"", "locationnumber": "5", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 7, "model": "philly.schooladdress", "fields": {"name": "0", "image": "C", "locationnumber": "6", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 8, "model": "philly.schooladdress", "fields": {"name": "0", "image": "C", "locationnumber": "1", "phone": ",", "address_street": "6", "address_zip": "0"}}, {"pk": 9, "model": "philly.schooladdress", "fields": {"name": "6", "image": "C", "locationnumber": "2", "phone": ",", "address_street": "7", "address_zip": "0"}}, {"pk": 10, "model": "philly.schooladdress", "fields": {"name": "0", "image": "C", "locationnumber": "2", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 11, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "4", "phone": ",", "address_street": "6", "address_zip": "0"}}, {"pk": 12, "model": "philly.schooladdress", "fields": {"name": "2", "image": "\"", "locationnumber": "5", "phone": ",", "address_street": "4", "address_zip": "0"}}, {"pk": 13, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "5", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 14, "model": "philly.schooladdress", "fields": {"name": "0", "image": "E", "locationnumber": "4", "phone": ",", "address_street": "3", "address_zip": "0"}}, {"pk": 15, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "7", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 16, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "4", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 17, "model": "philly.schooladdress", "fields": {"name": "0", "image": "F", "locationnumber": "7", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 18, "model": "philly.schooladdress", "fields": {"name": "2", "image": "F", "locationnumber": "2", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 19, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "2", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 20, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "2", "phone": ",", "address_street": "6", "address_zip": "0"}}, {"pk": 21, "model": "philly.schooladdress", "fields": {"name": "0", "image": "G", "locationnumber": "6", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 22, "model": "philly.schooladdress", "fields": {"name": "4", "image": "G", "locationnumber": "2", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 23, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "6", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 24, "model": "philly.schooladdress", "fields": {"name": "0", "image": "H", "locationnumber": "1", "phone": ",", "address_street": "3", "address_zip": "0"}}, {"pk": 25, "model": "philly.schooladdress", "fields": {"name": "5", "image": "\"", "locationnumber": "5", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 26, "model": "philly.schooladdress", "fields": {"name": "5", "image": "K", "locationnumber": "5", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 27, "model": "philly.schooladdress", "fields": {"name": "5", "image": "K", "locationnumber": "5", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 28, "model": "philly.schooladdress", "fields": {"name": "6", "image": "K", "locationnumber": "5", "phone": ",", "address_street": "0", "address_zip": "0"}}, {"pk": 29, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "6", "phone": ",", "address_street": "6", "address_zip": "0"}}, {"pk": 30, "model": "philly.schooladdress", "fields": {"name": "3", "image": "\"", "locationnumber": "4", "phone": ",", "address_street": "3", "address_zip": "0"}}, {"pk": 31, "model": "philly.schooladdress", "fields": {"name": "5", "image": "L", "locationnumber": "6", "phone": ",", "address_street": "4", "address_zip": "0"}}, {"pk": 32, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "8", "phone": ",", "address_street": "1", "address_zip": "0"}}, {"pk": 33, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "5", "phone": ",", "address_street": "6", "address_zip": "0"}}, {"pk": 34, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "2", "phone": ",", "address_street": "4", "address_zip": "0"}}, {"pk": 35, "model": "philly.schooladdress", "fields": {"name": "1", "image": "M", "locationnumber": "1", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 36, "model": "philly.schooladdress", "fields": {"name": "0", "image": "N", "locationnumber": "8", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 37, "model": "philly.schooladdress", "fields": {"name": "0", "image": "O", "locationnumber": "4", "phone": ",", "address_street": "2", "address_zip": "0"}}, {"pk": 38, "model": "philly.schooladdress", "fields": {"name": "0", "image": "P", "locationnumber": "5", "phone": ",", "address_street": "8", "address_zip": "0"}}, {"pk": 39, "model": "philly.schooladdress", "fields": {"name": "0", "image": "P", "locationnumber": "5", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 40, "model": "philly.schooladdress", "fields": {"name": "0", "image": "P", "locationnumber": "5", "phone": ",", "address_street": "7", "address_zip": "0"}}, {"pk": 41, "model": "philly.schooladdress", "fields": {"name": "0", "image": "P", "locationnumber": "5", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 42, "model": "philly.schooladdress", "fields": {"name": "0", "image": "P", "locationnumber": "6", "phone": ",", "address_street": "7", "address_zip": "0"}}, {"pk": 43, "model": "philly.schooladdress", "fields": {"name": "0", "image": "P", "locationnumber": "1", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 44, "model": "philly.schooladdress", "fields": {"name": "0", "image": "R", "locationnumber": "6", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 45, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "4", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 46, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "1", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 47, "model": "philly.schooladdress", "fields": {"name": "0", "image": "R", "locationnumber": "6", "phone": ",", "address_street": "3", "address_zip": "0"}}, {"pk": 48, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "6", "phone": ",", "address_street": "4", "address_zip": "0"}}, {"pk": 49, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "1", "phone": ",", "address_street": "0", "address_zip": "0"}}, {"pk": 50, "model": "philly.schooladdress", "fields": {"name": "6", "image": "S", "locationnumber": "2", "phone": ",", "address_street": "5", "address_zip": "0"}}, {"pk": 51, "model": "philly.schooladdress", "fields": {"name": "0", "image": "S", "locationnumber": "2", "phone": ",", "address_street": "0", "address_zip": "0"}}, {"pk": 52, "model": "philly.schooladdress", "fields": {"name": "1", "image": "S", "locationnumber": "4", "phone": ",", "address_street": "4", "address_zip": "0"}}, {"pk": 53, "model": "philly.schooladdress", "fields": {"name": "0", "image": "S", "locationnumber": "8", "phone": ",", "address_street": "9", "address_zip": "0"}}, {"pk": 54, "model": "philly.schooladdress", "fields": {"name": "0", "image": "U", "locationnumber": "1", "phone": ",", "address_street": "8", "address_zip": "0"}}, {"pk": 55, "model": "philly.schooladdress", "fields": {"name": "1", "image": "\"", "locationnumber": "2", "phone": ",", "address_street": "3", "address_zip": "0"}}, {"pk": 56, "model": "philly.schooladdress", "fields": {"name": "0", "image": "\"", "locationnumber": "8", "phone": ",", "address_street": "3", "address_zip": "0"}}, {"pk": 57, "model": "philly.schooladdress", "fields": {"name": "0", "image": "W", "locationnumber": "1", "phone": ",", "address_street": "2", "address_zip": "0"}}]